{
    "page": {
      "name": "agenda",
      "title": "Leaders' Day 2021 Agenda",
      "keywords":"",
      "description": "We've got some exciting breakout opportunities for you at leaders' day this year.",
      "pageConfig": {
        "showLive": true,
        "movingMenu": true,
        "showLogoText": true,
        "logoColor": "black",
        "showSearch": true,
        "showFooter": true,
        "showMenu": true,
        "weatherAlert": false
      },
      "content": [
        {
          "type": "og-tags",
          "image": "/static/images/og-images/homepage.jpg",
          "url": "https://www.themeetinghouse.com",
          "title": "Leaders' Day 2021 Agenda",
          "description": "This Leader’s Day we’re diving deeper into the concept of 'Parish Mindedness' by learning from the foremost experts on our local Parishes…each other!  You can expect to hear lots of great stories about ways our parishes have been serving their communities, plus you’ll have opportunities to engage in focused breakout sessions with other leaders like you about best practices for how to care for the people and places that God has positioned you to love."
        },
        {
          "type": "hero",
          "style": "full",
          "showCovid": false,
          "image1": [
            {
              "src": "/static/images/homepage-1-1.jpg",
              "alt": "Man sitting outside on a backyard patio talking and laughing with a group of friends.."
            },
            {
              "src": "/static/images/homepage-1-2.jpg",
              "alt": "Young man talking to his friend outside a church building."
            },
            {
              "src": "/static/images/homepage-1-3.jpg",
              "alt": "Young woman sitting at a table with her friends smiling and talking during home church."
            },
            {
              "src": "/static/images/homepage-1-4.jpg",
              "alt": "Young woman in glasses smiling and speaking with a friend."
            },
            {
              "src": "/static/images/homepage-1-5.jpg",
              "alt": "Two men talking outside on a backyard patio."
            },
            {
              "src": "/static/images/homepage-1-6.jpg",
              "alt": "Young woman talking to a friend outside on a backyard patio."
            },
            {
              "src": "/static/images/homepage-1-8.jpg",
              "alt": "Young woman in a face mask is sitting and talking to a friend off camera."
            }
          ],
          "header1": "Leaders' Day 2021",
          "text1": "This Leader’s Day we’re diving deeper into the concept of 'Parish Mindedness' by learning from the foremost experts on our local Parishes…each other!  You can expect to hear lots of great stories about ways our parishes have been serving their communities, plus you’ll have opportunities to engage in focused breakout sessions with other leaders like you about best practices for how to care for the people and places that God has positioned you to love.",
          "button1": {
            "text": "Watch live",
            "action": "/live",
            "description": "Click to watch leaders day live"
          }
        },
        {
          "type": "content",
          "style": "oneImageBlackRight",
          "header1": "Agenda",
          "list": [
            {
              "type": "link",
              "title": "9:00am - Welcome",
              "navigateTo": "/leadersdaylive"
            },
            {
              "type": "link",
              "title": "9:10am - Spiritual Practice",
              "navigateTo": "/leadersdaylive"
            },
            {
              "type": "link",
              "title": "9:20am - Storytelling",
              "navigateTo": "/leadersdaylive"
            },
            {
              "type": "link",
              "title": "9:40am - Breakout Sessions #1",
              "navigateTo": "/leadersdaylive"
            },
            {
              "type": "link",
              "title": "10:25am - Break",
              "navigateTo": "/leadersdaylive"
            },
            {
              "type": "link",
              "title": "10:30am - Storytelling",
              "navigateTo": "/leadersdaylive"
            },
            {
              "type": "link",
              "title": "10:45am - Breakout Sessions #2",
              "navigateTo": "/leadersdaylive"
            },
            {
              "type": "link",
              "title": "11:25am - Break",
              "navigateTo": "/leadersdaylive"
            },
            {
              "type": "link",
              "title": "11:30am - Encouragement and Prayer",
              "navigateTo": "/leadersdaylive"
            },
            {
              "type": "link",
              "title": "11:45am - Parish Communion",
              "navigateTo": "/leadersdaylive"
            }
          ],
          "image1": [
            {
              "src": "/static/images/LeadersDay1.jpg",
              "alt": "Two men inside of a building smiling and hugging."
            }
          ]
        },
        {
          "type": "content",
          "style": "oneImage",
          "header1": "Bingo Card",
          "list": [
            {
              "type": "link",
              "title": "Download Bingo Card",
              "navigateTo": "/community"
            }
          ],
          "image1": [
            {
              "src": "/static/images/homepage-2-new.jpg",
              "alt": "Group of friends from church sitting together, and talking."
            }
          ]
        },
        {
          "type": "list",
          "style": "imageList",
          "class": "user-defined",
          "header1": "Choose your own adventure",
          "text1": "You’re the expert in what will be helpful for you to learn about, so that’s why we’re spending the bulk of our Leader’s Day in Breakout Sessions led by leaders from our local parishes.  From how to build community online to handling divisive conversations without losing your cool, there’s a wide range of practical topics for you to choose from during both of our Breakout Sessions.",
          "list": [
            {
              "title": "Creating spaces that work for the whole family - Natalie Frisk",
              "text": "When we talk about ‘the whole family,’ we aren't just talking about a nuclear family, but every age and stage. Every sibling in Christ from the very youngest to the eldest. With this in mind, we'll learn together by considering discipleship together through a lens of intergenerational experiences and discover how we can really connect in meaningful ways.",
              "imageSrc": "/static/photos/leadersdaypictures/NatalieFrisk.jpg",
              "imageAlt": "Young woman sitting at a table and looking at her notes from Sunday teaching at The Meeting House.",
              "navigateTo": "/teaching"
            },
            {
              "title": "Creating Community In An Online World - Jordan Duerrstein and Mary Kate",
              "text": "In March 2020, we transitioned really quickly to shift the vast majority of our church life into an online space. Zoom calls, WhatsApp groups, Discord servers … for some of us, this was new territory. For others, this had been our home for years. Come learn and discuss some best practices for creating environments online that are accessible, engaging, and spiritually transformative.",
              "imageSrc": "/static/photos/leadersdaypictures/JordanD.jpg",
              "imageAlt": "Screen shot of Bruxy teaching during Sunday morning livestream at The Meeting House.",
              "navigateTo": "/live"
            },
            {
              "title": "Caring for others while caring for yourself - Kathy Bernard & Marty Whittaker",
              "text": "Setting healthy boundaries can be one of the most loving things you can do - join us as we look at how to set boundaries in a Jesus way.",
              "imageSrc": "/static/photos/staff/Kathy_Bernard_app.jpg",
              "imageAlt": "Team of pastors from The Meeting House sitting around a table and recording a podcast.",
              "navigateTo": "/teaching-podcasts"
            },
            {
              "title": "What are Fresh Expressions of Church? - Jon Hand & Stephen Kidd",
              "text": "How do we share our faith with friends, neighbours, coworkers, or family who aren’t into church or even into a church for those not into church? Spoiler alert! If people won’t come to church, we take the church to them. Fresh Expressions are innovative ways to build community and introduce spiritually curious to people to the Jesus-centred life. This workshop will give you an overview of Fresh Expressions of church and share a few stories, tools, postures, and approaches to help us pioneer new ways of being the church for those not into church.",
              "imageSrc": "/static/photos/staff/Jon_Hand_app.jpg",
              "imageAlt": "Kids gathering around a smartphone to watch a video from The Meeting House Kids and Youth curriculum.",
              "navigateTo": "/teaching-kids-youth"
            },
            {
              "title": " Walking Through Divisive Days as A Leader - Chris Chase",
              "text": "Jesus’ prayer in John 17 was for his disciples across all generations to be unified as an expression of God’s love for the world. And yet, we find ourselves in days of deep division, difficult conversations, and the struggle to maintain the loving unity Jesus longs for us. How do we model grace and acceptance when people feel “othered”? How do we “keep the main thing the main thing”? Come listen and share your learnings as we “make every effort to keep the unity of the Spirit through the bond of peace.” Eph 4:3-6.",
              "imageSrc": "/static/photos/leadersdaypictures/ChrisChase.jpg",
              "imageAlt": "Kids gathering around a smartphone to watch a video from The Meeting House Kids and Youth curriculum.",
              "navigateTo": "/teaching-kids-youth"
            },
            {
              "title": "Simple Ways to Become More Invested in Your Neighbourhood - Steve MacDouell, Sandy MacLean, and Carol MacLean",
              "text": "What might it look like to become a more present, attentive, and engaged presence in our neighbourhoods? Together, we’ll explore some small-scale, practical ways that we can begin to pivot toward our neighbourhoods and the people that we share them with. ",
              "imageSrc": "/static/photos/leadersdaypictures/SandyCarolMacLean.jpg",
              "imageAlt": "Kids gathering around a smartphone to watch a video from The Meeting House Kids and Youth curriculum.",
              "navigateTo": "/teaching-kids-youth"
            }
          ]
        },
        {
          "type": "list",
          "style": "vertical",
          "class": "compassion",
          "header1": "Idea sharing lobby: Coordinators connect",
          "text1": "If you’ve got practical questions or are just looking to have some REALLY nuts and bolts convos about leading things like Tech, Set-Up, Music, Compassion, Kids, Prayer or Youth during this wild regathering season, hop in the Idea Sharing Lobby during Breakout Session #1 to talk with other people in your role about the challenges and successes that they are having.",
          "filterField": "sites",
          "filterValue": "connect"
        }
      ]
    }
  }
  