{
  "page": {
    "name": "covid-19-response",
    "title": "Church Family Update",
    "keywords": "",
    "description": "",
    "pageConfig": {
      "showLive": true,
      "movingMenu": false,
      "showLogoText": false,
      "logoColor": "white",
      "showSearch": false,
      "showFooter": false,
      "showMenu": false,
      "isPopup": true,
      "navigateOnPopupClose": "/"
    },
    "content": [
      {
        "type": "og-tags",
        "image": "/static/images/og-images/covid19.jpg",
        "url": "https://www.themeetinghouse.com/covid19",
        "title": "Church Family Update",
        "description": "Check out the latest updates from The Meeting House."
      },
      {
        "type": "simple",
        "header1": "Church Family Update",
        "header2": "",
        "text": [
          {
            "class": "SimpleItemText",
            "text": "March 9 - Due to the hundreds of questions we’ve received already, and the activity we’re seeing on social media, we’ve decided to host our Q & A Town Hall at the earliest opportunity."
          },
          {
            "class": "SimpleItemText",
            "text": "We invite you to join this live streamed event this Thursday at 7pm. You can continue to send your questions to townhall@themeetinghouse.com."
          },
          {
            "class": "SimpleItemText",
            "text": "Maggie John, Chair of the Overseers Board"
          },
          {
            "class": "SimpleItemText",
            "text": "March 8 - We shared with our church community in early December that allegations of sexual misconduct were made against Bruxy Cavey. As soon as this information came to the attention of the Overseers Board, the Overseers put him on a leave of absence, and the church retained an external independent third-party investigator to conduct a thorough investigation into the allegations and to provide the Overseers Board with the findings."
          },
          {
            "class": "SimpleItemText",
            "text": "The investigator’s work is now complete. Over the last number of days, the Overseers have read the report and we have taken time to process the information and consider the required actions."
          },
          {
            "class": "SimpleItemText",
            "text": "The investigator determined that Bruxy had maintained a sexual relationship with the Victim, an adult woman, in violation of The Meeting House policy and the Handbook of Faith and Life of Be in Christ Church of Canada. The investigator also found that what became a sexual relationship between Bruxy and the Victim, which lasted over an extended period of time, constituted an abuse of Bruxy’s power and authority as a member of the clergy, and amounted to sexual harassment."
          },
          {
            "class": "SimpleItemText",
            "text": "Due to the seriousness of the investigator’s findings, our Board unanimously decided to ask Bruxy to resign from his role at The Meeting House effective immediately. Bruxy then submitted his resignation on March 3rd, which the Overseers accepted."
          },
          {
            "class": "SimpleItemText",
            "text": "The Meeting House stands against sexual misconduct, sexual harassment, and abuse of power and authority. We are praying through this situation."
          },
          {
            "class": "SimpleItemText",
            "text": "Maggie John - Chair of the Overseers Board of The Meeting House"
          }
        ]
      }
    ]
  }
}
