{
    "page": {
      "name": "Church Update Summary",
      "title": "Church Update Summary",
      "keywords": "",
      "description": "",
      "pageConfig": {
        "showLive": true,
        "movingMenu": false,
        "showLogoText": false,
        "logoColor": "white",
        "showSearch": false,
        "showFooter": false,
        "showMenu": false,
        "isPopup": true,
        "navigateOnPopupClose": "/victimadvocacy"
      },
      "content": [
        {
          "type": "og-tags",
          "image": "/static/images/og-images/TMH-House-Logo.jpg",
          "url": "https://www.themeetinghouse.com/churchupdatesummary",
          "title": "Church Update Summary",
          "description": "Latest news from The Meeting House."
        },
        {
          "type": "simple",
          "header1": "Church Family Updates",
          "header2": "",
          "text": [
            {
              "class": "SimpleItemTextBold",
              "text": "September 30, 2022"
              },
              {
                "class": "SimpleItemText",
                "text": "We continue working to bring resolution to the referrals that have been received through our victim advocacy process as people have come forward with their stories. Through this process, an instance from our church’s past has resurfaced that we believe needs to be revisited and shared properly as part of our commitment to revealing truth, taking responsibility for harm caused by leaders in our church, and supporting victims in the process of healing and recovery."
              },
              {
                "class": "SimpleItemText",
                "text": "Craig Douglas was a worship pastor on staff at The Meeting House between 2002 to 2010. During that time, Craig engaged in an inappropriate sexual relationship with a member of his team, in violation of the church’s sexual harassment policy. Craig admitted to the allegation at the time and his employment with The Meeting House ended. Unfortunately, this incident was not communicated to our community."
              },
              {
                "class": "SimpleItemText",
                "text": "According to the current definition of sexual abuse that we have adopted*, these events would be considered sexual abuse by a church leader. We grieve with and apologize to the victim involved in this situation for the harm they experienced as a member of our church. We commend those that came forward with this story for their courage in speaking truth. We also apologize to the church for the breach of trust that took place, as well as for the way Craig’s departure from staff was communicated at the time."
              },
              {
                "class": "SimpleItemText",
                "text": "At this time, we do not anticipate conducting an investigation."
              },
              {
                "class": "SimpleItemText",
                "text": "In the fall of 2021, Craig applied for and was invited into a contract role as Worship and Arts Leader for our livestream. When the above disclosure was submitted and brought to the attention of the Overseers, Craig was asked to step down from his role and willingly did. Craig has demonstrated a heart of confession and repentance for what took place."
              },
              {
                "class": "SimpleItemText",
                "text": "It continues to be the commitment of the Overseers to have zero tolerance for abuse of any kind. As a church family, we stand with those who have experienced any form of abuse in their pain and grief, while holding to the hope of healing for the victim and reconciliation for the offender. We hold on to this hope made possible by the grace of Jesus through the Holy Spirit."
              },
              {
                "class": "SimpleItemText",
                "text": "Thank you for continuing to pray with us as we follow Jesus together on this journey as a church."
              },
              {
                "class": "SimpleItemText",
                "text": " "
              },
              {
                "class": "SimpleItemText",
                "text": "*Mennonite Central Committee (MCC) defines sexual abuse by a church leader or caregiver as any sexualized behavior that occurs within the church context and where one party has more power than the other."
              },
              {
                "class": "SimpleItemText",
                "text": " "
              },
            {
              "class": "SimpleItemTextBold",
              "text": "September 24, 2022"
              },
              {
                "class": "SimpleItemTextBold",
                "text": "No Tolerance for Harrassment"
              },
              {
                "class": "SimpleItemText",
                "text": "You may have seen a recent publication by the Toronto Star regarding the first victim and the harassment she has experienced online."
              },
              {
                "class": "SimpleItemText",
                "text": "The Meeting House is committed to standing with victims and appreciates their courage in coming forward. As part of this continued commitment, we have a zero-tolerance stance on harassment and we are continually taking action against any harassment that we learn of."
              },
              {
                "class": "SimpleItemText",
                "text": "Whenever we have found or been made aware of any online harassment towards the victims, we have done everything in our power to remove this content from our own social media accounts (such as comments on posts) or, when we are not able to remove it ourselves, we have requested the content be removed by the platform (such as posts or comments by others). We continue to monitor for this and will take every action against it should it continue."
              },
              {
                "class": "SimpleItemText",
                "text": "As we address these instances, we have also reported them to the police where we believe it is appropriate and our responsibility to do so.  We will continue to report any threats or harassment to the police, and encourage anyone who sees this behaviour or has any relevant information to do the same."
              },
              {
                "class": "SimpleItemText",
                "text": " "
              },
            {
              "class": "SimpleItemTextBold",
              "text": "August 13, 2022"
              },
              {
                "class": "SimpleItemTextBold",
                "text": "Investigation Results"
              },
              {
                "class": "SimpleItemText",
                "text": "Thank you for journeying alongside us this year. Today we have more hard news to share. Please note that the following content may be triggering to some."
              },
              {
                "class": "SimpleItemText",
                "text": "We have now received the results of the second and third investigations into allegations of sexual abuse and sexual misconduct brought against former Senior Pastors Bruxy Cavey and Tim Day, respectively."
              },
              {
                "class": "SimpleItemText",
                "text": "Please watch this video message from Bruce and Nour from our Board of Overseers for an update with the findings."
              },
              {
                "type": "link",
                "class": "SimpleItemLink",
                "text": "Video Update",
                "href": "https://youtu.be/_C6JhTOARdA"
              },
              {
                "class": "SimpleItemText",
                "text": " "
              },
              {
                "class": "SimpleItemText",
                "text": "Our Town Hall is tomorrow, Sunday, August 14, from 7:00 PM—8:30 PM at The Meeting House Oakville, 2700 Bristol Circle, Oakville. The doors will open at 6:30 PM. Please enter through the West entrance, and we will gather in the theatre."
              },
            {
              "class": "SimpleItemText",
              "text": "We will be reviewing the results of the investigations, talking about how we are responding as a church, and taking time to dialogue and respond to some of your questions. You can send questions to the email below:"
            },
            {
              "type": "link",
              "class": "SimpleItemLink",
              "text": "leadership@themeetinghouse.com",
              "href": "mailto:leadership@themeetinghouse.com"
            },
            {
              "class": "SimpleItemText",
              "text": " "
            },
            {
              "class": "SimpleItemText",
              "text": "If you are unable to attend in person, we will be livestreaming the gathering at the link below:"
            },
            {
              "type": "link",
              "class": "SimpleItemLink",
              "text": "Livestream Link",
              "href": "https://youtu.be/aTNCEYSoHRk"
            },
            {
              "class": "SimpleItemText",
              "text": " "
            },
            {
              "class": "SimpleItemText",
              "text": "For more details, please keep reading."
            },
            {
              "class": "SimpleItemTextBold",
              "text": "Understanding and defining Sexual Abuse by a Church Leader"
            },
            {
              "class": "SimpleItemText",
              "text": "With a learning and listening posture, and through the process of two additional investigations, The Meeting House has adopted the widely recognized definition of sexual abuse offered by the Mennonite Central Committee (MCC), as found in their publication below:"
            },
            {
              "type": "link",
              "class": "SimpleItemLink",
              "text": "Understanding Sexual Abuse by a Church Leader or Caregiver",
              "href": "https://abuseresponseandprevention.ca/wp-content/uploads/2018/05/UnderstandingSexualAbusebyaChurchLeaderBooklet18_web.pdf"
            },
            {
              "class": "SimpleItemText",
              "text": " "
            },
            {
              "class": "SimpleItemText",
              "text": "That definition is as follows:"
            },
            {
              "class": "SimpleItemText",
              "text": "“Sexual abuse by a church leader or caregiver refers to any sexualized behaviour that occurs within the church context and where one party has more power than the other. The perpetrator can be anyone in a leadership position, either paid or volunteer. It could be a pastor, Christian counselor, youth leader, deacon or Sunday School teacher.”"
            },
            {
              "class": "SimpleItemText",
              "text": "MCC additionally defines sexual abuse and sexualized behaviour as follows:"
            },
            {
              "class": "SimpleItemText",
              "text": "“Sexual abuse or sexualized behaviour includes any physical contact, bodily movement, or verbalization that uses sexual expression to control or intimidate the less powerful person in the relationship. The acts involved may be overt, involving actual physical contact of a sexualized nature or covert, as in pornography, sexual innuendo, or inappropriate disclosures of a personal nature regarding sexual matters. The person victimized may be an adult or a child, female or male, and the same or of the opposite sex as the offender.”"
            },
            {
              "class": "SimpleItemText",
              "text": "Having clear definitions gives us a mutual understanding of terms and also creates accountability so we can apply and use terms appropriately."
            },
            {
              "class": "SimpleItemTextBold",
              "text": "Update on the second and third investigations"
            },
            {
              "class": "SimpleItemText",
              "text": "We have now received the results of the second and third investigations into allegations of sexual abuse and sexual misconduct brought against former Senior Pastors Bruxy Cavey and Tim Day, respectively."
            },
            {
              "class": "SimpleItemText",
              "text": "These investigations were conducted by Natasha Persaud, an independent, third-party investigator to ensure that there was protection for the confidentiality of complainants and that the entire process was approached in an objective, trauma-informed, and timely manner."
            },
            {
              "class": "SimpleItemText",
              "text": "Here are the results for the second investigation into Bruxy Cavey:"
            },
            {
              "class": "SimpleItemText",
              "text": "In this second investigation, two sets of claims of sexual abuse by a church leader (as defined above) have been substantiated. In the third, his actions have been found to be substantiated as sexual misconduct. In one case, the victim was underaged when the abuse took place."
            },
            {
              "class": "SimpleItemText",
              "text": "The investigation into Tim Day was conducted separately. He chose not to participate in the investigation, and was provided with multiple opportunities to do so. The victim’s allegations against Tim Day were substantiated as sexual abuse by a church leader."
            },
            {
              "class": "SimpleItemText",
              "text": "In all cases, the victims have suffered great harm. We grieve deeply at the hurt caused to each of these individuals at our church."
            },
            {
              "class": "SimpleItemText",
              "text": "We also acknowledge the courage of those who stepped forward. We are grateful for their bravery, and willingness to be vulnerable. As church leadership, we humbly and profoundly apologize to them for the pain they experienced at the hands of The Meeting House pastors whom they—and we—trusted."
            },
            {
              "class": "SimpleItemTextBold",
              "text": "Victim 1 and the first investigation"
            },
            {
              "class": "SimpleItemText",
              "text": "We wish to commend the first victim for coming forward, and for opening the door for others to come forward. We know she has endured so much in this process."
            },
            {
              "class": "SimpleItemText",
              "text": "In March of this year, we shared the results of the first investigation, which used the language of “an abuse of power and authority as a member of the clergy,” and “sexual harassment.” At the time, we hadn’t adopted a definition for sexual abuse by a church leader, and we chose to use the exact language from the report. We were careful not to add our own interpretation to the findings, as we believed the language was strong enough to communicate the seriousness of the findings."
            },
            {
              "class": "SimpleItemText",
              "text": "We have learned so much over the last nine months, and with this knowledge and the adoption of MCC's definition of sexual abuse, we have revisited the findings of the first investigation. We have now concluded as a board that the actions substantiated in the first investigation constitute sexual abuse by a church leader."
            },
            {
              "class": "SimpleItemText",
              "text": "We truly apologize to the first victim for the length of time this has taken."
            },
            {
              "class": "SimpleItemText",
              "text": "We’ve also learned how vital it is to have a safe, confidential, and responsive channel for individuals to bring forward their concerns or issues. We continue to be thankful for the pivotal role Melodie Bissell has played as our Victim Advocate."
            },
            {
              "class": "SimpleItemTextBold",
              "text": "Next Steps"
            },
            {
              "class": "SimpleItemText",
              "text": "We invite you to process this news together with us as a church this Sunday. Details are above. We will share from our hearts, and set aside time for answering questions as candidly as we can. We anticipate creating more spaces to pray and process together in community in the coming weeks and months."
            },
            {
              "class": "SimpleItemText",
              "text": "We ask you to continue to pray for healing for the victims and for their families, who have also been impacted by this abuse. Pray for the Cavey family and the Day family. Pray for our church family that God will use this season for his glory, honour, and praise."
            },
            {
              "class": "SimpleItemText",
              "text": "In the meantime, we want you to know that we are taking steps based on what we are learning; Melodie Bissell will continue in her victim advocacy role for the foreseeable future, we are engaged with an expert who is helping us to tell our story, and we are strengthening Board and staff policies and processes to improve accountability and transparency. Additionally, the Senior Leadership Team is working towards creating a healthier staff and church culture as part of their mandate."
            },
            {
              "class": "SimpleItemText",
              "text": "We have more work to do here, including building a framework with standards of conduct, procedures, and policies that are collectively understood and applied. We appreciate your patience as we evaluate and undertake this critical work."
            },
            {
              "class": "SimpleItemText",
              "text": "Even though these investigations have concluded, our victim advocacy programme is still in effect. We encourage anyone who thinks they may have experienced sexual misconduct or abuse by a church leader within The Meeting House to contact Melodie Bissell confidentially at:"
            },
            {
              "type": "link",
              "class": "SimpleItemLink",
              "text": "416-518-1058",
              "href": "tel:416-518-1058"
            },
            {
              "type": "link",
              "class": "SimpleItemLink",
              "text": "mbissell@traumacareconsulting.com",
              "href": "mailto:mbissell@traumacareconsulting.com"
            },
            {
              "type": "link",
              "class": "SimpleItemLink",
              "text": "Online referral form",
              "href": "https://form.jotform.com/220701021515538"
            },
            {
              "class": "SimpleItemText",
              "text": " "
            },
            {
              "class": "SimpleItemText",
              "text": "We want to thank you for walking with us during this season of lament, listening, and learning. We value your questions, concerns, and input. As we continue to journey through this difficult time together, we are reminded of our purpose as a church and the promise of Jesus, that He is “close to the brokenhearted and saves those who are crushed in spirit.” May you sense and know this truth as we pray and process together."
            },
            {
              "class": "SimpleItemTextBold",
              "text": "June 28, 2022"
              },
              {
                "class": "SimpleItemTextBold",
                "text": "Support for the First Victim"
              },
              {
                "class": "SimpleItemText",
                "text": "Many have asked what ways we have offered or are supporting the victim from Bruxy’s first investigation."
              },
              {
                "class": "SimpleItemText",
                "text": "We have not done this perfectly, but we are learning not to assume what meaningful response, care, and support looks like. It is our desire and intention to provide each victim with the support and care that will be meaningful to them. "
              },
              {
                "class": "SimpleItemText",
                "text": "Our Victim Advocate (Melodie Bissell) asks each person who comes forward what their desired outcome(s) are, including what meaningful ways we can provide them with support and care. The first victim has reached out to Melodie and has asked Melodie to advocate on her behalf to realize her desired outcome. We hope in the near future to provide the first victim with the answers, care, and support she deeply desires and needs. "
              },
              {
                "class": "SimpleItemText",
                "text": "We remain thankful for her courage to speak out. Because of her courage in coming forward, many other voices are finally being heard. Please continue to pray for the victim."
              },
            {
              "class": "SimpleItemTextBold",
              "text": "Support for the Cavey Family"
            },
            {
              "class": "SimpleItemText",
              "text": "At the Community Gathering we shared that as Overseers we decided to provide some support to the Cavey family. We understand this has raised concerns and questions, and we want to provide as much information as we can. "
            },
            {
              "class": "SimpleItemText",
              "text": "While we are unable to disclose the confidential details of the support, we can share our rationale and desired outcome in extending it."
            },
            {
              "class": "SimpleItemText",
              "text": "In light of the outcome of the first investigation we wrestled with this decision. We considered our call to demonstrate compassion for members of the Cavey family. After careful thought, prayer, and discussion we decided to provide some limited support for the family."
            },
            {
              "class": "SimpleItemText",
              "text": "We want to be clear: the findings of the first investigation are serious and we stand behind them. Our desire in extending limited support is to demonstrate compassion for the Cavey family as a whole, including Nina and their children. Please continue to pray for the Cavey family."
            },
            {
              "class": "SimpleItemTextBold",
              "text": "Other Financial Obligations"
            },
            {
              "class": "SimpleItemText",
              "text": "Another question that arose during our Community Gathering was about other financial obligations we have in this season. As Overseers we are responsible for ensuring that we steward your giving well. We believe that as a church it is important to invest in the difficult work of turning on the lights; seeking truth. Since December, we have obtained a Victim Advocate, Third-Party Investigators, Legal Counsel, and Professional Counsellors to help us care for our community well as we navigate this season. While it remains challenging to predict with certainty what these costs might be moving forward, we are working diligently to monitor and minimize our expenses, in an effort to ensure that the bulk of your giving is directed toward impactful ministry within our communities."
            },
                {
                "class": "SimpleItemTextBold",
                "text": "June 17, 2022"
                },
                {
                  "class": "SimpleItemText",
                  "text": "Our Senior Leadership Team and Board of Overseers are committed to regular, informative, and transparent communication throughout this season. You can expect an update email at least once per month, in addition to other touchpoints."
                },
                {
                  "class": "SimpleItemTextBold",
                  "text": "Victim Advocacy"
                },
                {
                  "class": "SimpleItemText",
                  "text": "At the Gathering, we shared that, to date, Melodie Bissell, our Victim Advocate has received 38 referrals. Since sharing this information, we’ve received several questions about that number and we want to give further clarification."
                },
                {
                  "class": "SimpleItemText",
                  "text": "The 38 referrals are not unique sets of sexual misconduct allegations. They represent allegations, disclosures, and concerns relating primarily to clergy sexual misconduct, harassment, and abuse by a number of former pastors and church leaders."
                },
                {
                  "class": "SimpleItemText",
                  "text": "Some of the allegations made in the 38 referrals are repeated more than once; the Victim Advocate prepares a report with desired outcomes for each person who contacts her. This means that there are not 38 separate allegations. Melodie also gives each person options that are available to them if they wish to escalate the matter. Each report is then read by the Victim Advocacy Committee of The Board of Overseers to determine appropriate next steps."
                },
                {
                  "class": "SimpleItemText",
                  "text": "Some of the allegations relate to former youth pastors, Kie Naidoo and Dave Churchill. We were already aware of some of those allegations. Kie Naidoo and Dave Churchill have not worked at our church for a number of years."
                },
                {
                    "class": "SimpleItemText",
                    "text": "Some of the allegations are against Bruxy Cavey. As you are aware, there is one ongoing investigation into allegations against Bruxy (made by three different women). At this stage, these are allegations only. They are currently being investigated and no findings will be concluded until the investigation is complete."
                },
                {
                  "class": "SimpleItemText",
                  "text": "Some of the allegations include sexual misconduct allegations against former Senior Pastor, Tim Day. At this stage, these are allegations only. They are currently being investigated and no findings will be concluded until the investigation is complete."
              },
              {
                "class": "SimpleItemText",
                "text": "A number of referrals are from people who have felt that the church did not, in the past, respond properly when they came forward with allegations of sexual misconduct. The Victim Advocate has been an important channel for people who feel hurt by our church. We grieve with all victims and are committed to taking allegations of sexual misconduct seriously. We welcome all voices as we continue to journey on the path of bringing the truth to light."
              },
              {
                "class": "SimpleItemText",
                "text": "There are also referrals that have come in to the Victim Advocate that relate to matters other than sexual misconduct, abuse, or harassment. For instance, some community members have used this channel to share concerns they had regarding relational breakdowns within their local communities."
              },
              {
                "class": "SimpleItemText",
                "text": "We encourage anyone who thinks they may have experienced sexual misconduct or abuse by a pastor, staff member, or lay leader within The Meeting House to contact Melodie Bissell confidentially below:"
              },
              {
                "type": "link",
                "class": "SimpleItemLink",
                "text": "416-518-1058",
                "href": "tel:416-518-1058"
              },
              {
                "type": "link",
                "class": "SimpleItemLink",
                "text": "mbissell@traumacareconsulting.com",
                "href": "mailto:mbissell@traumacareconsulting.com"
              },
              {
                "type": "link",
                "class": "SimpleItemLink",
                "text": "Online referral form",
                "href": "https://form.jotform.com/220701021515538"
              },
              {
                "class": "SimpleItemText",
                "text": " "
              },
              {
                "class": "SimpleItemTextBold",
                "text": "Care and Healing"
              },
              {
                "class": "SimpleItemText",
                "text": "Understanding and telling our story is necessary in order to truly come to the place of repentance and healing; this process takes time, effort, and patience to conduct properly, authentically, and well. We shared about an approach to telling our story that involves learning, taking ownership, lamenting, repenting, healing, and restoration so we can move forward humbly and more like Jesus. We are currently reviewing proposals from people who might be able to partner with us through this process, and we believe this long and difficult work will be key to moving forward as a church."
              },
              {
                "class": "SimpleItemText",
                "text": "We trust this information is helpful. Thank you for praying with us and walking this journey together as we fix our eyes on Jesus."
              },
            {
                "class": "SimpleItemTextBold",
                "text": "June 7, 2022"
            },
            {
              "class": "SimpleItemText",
              "text": "Now more than ever, it’s important for us to come together as a community of Jesus-followers to centre on Jesus and seek out where God is leading us."
            },
            {
              "class": "SimpleItemText",
              "text": "Join us on Tuesday, June 7th from 7:00 – 8:30 PM as we worship and pray, take stock of where we are as a church, and share where we sense God is calling us together in this season. We will also have time afterwards for those who wish to connect and chat further."
            },
            {
              "class": "SimpleItemText",
              "text": "While we plan to review a summary of the ongoing investigations and host a brief Q & A, our time will be focused on prayerfully committing to the difficult work of understanding and learning from our history as a church (the pain and the beauty), and charting our next steps together."
            },
            {
              "class": "SimpleItemText",
              "text": "If you have questions you hope to have addressed on Tuesday, please send them to the email below:"
            },
            {
              "type": "link",
              "class": "SimpleItemLink",
              "text": "leadership@themeetinghouse.com",
              "href": "mailto:leadership@themeetinghouse.com"
          },
          {
            "class": "SimpleItemText",
            "text": " "
          },
          {
            "class": "SimpleItemText",
            "text": "We will do our best to answer the most commonly asked questions and follow up by email with any that we can’t address due to time constraints."
          },
            {
              "class": "SimpleItemText",
              "text": "This gathering is about coming together as a church family and centering on Jesus; we hope you will join us in person so we can better connect with one another. For those unable to attend in person, the gathering will also be live streamed so you can still join in. The details are below."
            },
            {
              "class": "SimpleItemText",
              "text": "Tuesday, June 7, from 7:00pm—8:30pm at The Meeting House Oakville, 2700 Bristol Circle, Oakville, L6H 6E1. The doors will be open at 6:30 PM. Please enter through the West entrance, grab a nice hot cup of coffee, and we will gather together in the theatre. "
            },
            {
                "class": "SimpleItemText",
                "text": "If you are unable to attend in person, we will be livestreaming the gathering at the link below. You can click it now if you know you won't be able to attend in order to add it to your calendar."
              },
              {
              "type": "link",
              "class": "SimpleItemLink",
              "text": "Livestream Link",
              "href": "https://youtu.be/TOypJQmumEM"
              },
              {
              "class": "SimpleItemText",
              "text": " "
              },
              {
                "class": "SimpleItemTextBold",
                "text": "June 6, 2022"
              },
              {
                "class": "SimpleItemText",
                "text": "Today we learned that Hamilton Police have arrested former pastor Bruxy Cavey and charged him with sexual assault. The release from the Hamilton Police states that at the time of the assault, Bruxy was the Teaching Pastor at The Meeting House. You can find the release statement below:"
              },
              {
                  "type": "link",
                  "class": "SimpleItemLink",
                  "text": "Release",
                  "href": "https://hamiltonpolice.on.ca/news/57-year-old-male-arrested-in-sexual-assault-investigation/"
                },
                {
                  "class": "SimpleItemText",
                  "text": " "
                },
              {
                "class": "SimpleItemText",
                "text": "We have no details about the charge other than what is in the Hamilton Police release. At this time, The Meeting House is not privy to this court proceeding. The Meeting House has cooperated with the police and has offered our continued cooperation. As this matter is currently before the courts, we cannot comment any further."
              },
              {
                "class": "SimpleItemText",
                "text": "We continue to grieve with all victims and are committed to taking all allegations of sexual misconduct seriously. In March, our church engaged Melodie Bissell as a Victim Advocate. We encourage anyone who thinks they may have experienced sexual misconduct or abuse by a pastor, staff member, or lay leader within The Meeting House to contact Melodie Bissell confidentially at the links below:"
              },
              {
                  "type": "link",
                  "class": "SimpleItemLink",
                  "text": "416-518-1058",
                  "href": "tel:416-518-1058"
              },
              {
                  "type": "link",
                  "class": "SimpleItemLink",
                  "text": "mbissell@traumacareconsulting.com",
                  "href": "mailto:mbissell@traumacareconsulting.com"
              },
              {
                  "type": "link",
                  "class": "SimpleItemLink",
                  "text": "Online referral form",
                  "href": "https://form.jotform.com/220701021515538"
              },
              {
                "class": "SimpleItemText",
                "text": " "
              },
              {
                "class": "SimpleItemText",
                "text": "We know this news is very difficult to read. As a church family we want to continue praying together. We hope to see you at our Community Gathering tomorrow, June 7, at the Oakville site and online, as we seek God together. Check your inbox for details or take a look at our invite information below:"
              },
              {
                "type": "link",
                "class": "SimpleItemLink",
                "text": "Community Gathering",
                "href": "https://www.themeetinghouse.com/communitygathering"
              },
              {
                "class": "SimpleItemText",
                "text": " "
              },
              {
                "class": "SimpleItemText",
                "text": "Senior Leadership Team and The Board of Overseers"
              },
              {
                "class": "SimpleItemTextBold",
                "text": "May 21, 2022"
              },
              {
                "class": "SimpleItemText",
                "text": "On May 13th, we shared that more concerning allegations, unrelated to Bruxy Cavey, came to our attention."
              },
              {
                "class": "SimpleItemText",
                "text": "Recently, an individual contacted our victim advocate, Melodie Bissell, with allegations of sexual misconduct and abuse against former Senior Pastor, Tim Day, during his employment at The Meeting House. We take these allegations very seriously. When Melodie was given permission by the individual, we immediately informed legal counsel and have retained Natasha Persaud as an independent third party investigator to investigate these allegations."
              },
              {
                "class": "SimpleItemText",
                "text": "We grieve with all victims and are committed to taking all allegations of sexual misconduct seriously."
              },
              {
                "class": "SimpleItemText",
                "text": "While we have limited information to share about this or the other investigations at this time, we would like to have some critical conversations as a church family, recognizing that we’re collectively carrying a heavy burden. We are hosting a community gathering on Tuesday, June 7th at 7:00pm to pray, grieve, and seek God’s direction, together. This will be in person at the Oakville site and live streamed for those who can’t make it in person."
              },
              {
                "class": "SimpleItemText",
                "text": "For our church, this is not an easy path. We are committed to better understanding our past so we can grieve, repent, be healed, and grow to be better stewards of Jesus’ love in the world."
              },
              {
                "class": "SimpleItemText",
                "text": "Please continue to pray with us for the healing of victims and that God would continue to work in and through our church. We will communicate further as we are able."
              },
              {
                "class": "SimpleItemTextBold",
                "text": "May 13, 2022"
              },
              {
                "class": "SimpleItemText",
                "text": "At the end of March, we shared the news that two further allegations of sexual misconduct had been brought forward through our victim advocate, and that another investigation was underway at the request of the complainants. Since then, an additional allegation has come forward and been added to the new investigation. All of these allegations relate to Bruxy Cavey. We expect this investigation will proceed on a similar timeline to the first investigation. We’ll continue to update you as we are able."
              },
              {
                "class": "SimpleItemText",
                "text": "We’ve also started receiving other reports from our victim advocate, Melodie Bissell, which are unrelated to Bruxy Cavey. We’re thankful for the courageous women and men who have shared their stories of hurt and abuse. We’re humbled to now be the stewards of those stories. How we respond as a church matters. As we’re able, we’ll share more in the coming days. For now, we’re focused on listening to these stories from those who have carried such pain and felt unheard for too long. We’re committed to learning, understanding, and revealing truth—and to being and doing better. We’re working first to respond to their questions, updating our policies, and implementing best practices. We appreciate your prayers as we know we don’t have it all figured out. However, we do know that we want to be the kind of church we’ve always thought we were: loving like Jesus. We’ll need to do this work together."
              },
              {
                "class": "SimpleItemText",
                "text": "We grieve with all victims and are committed to taking all allegations of sexual misconduct seriously."
              },
              {
                "class": "SimpleItemText",
                "text": "Senior Leadership Team and The Board of Overseers"
              },
              {
                "class": "SimpleItemTextBold",
                "text": "March 19, 2022"
              },
              {
                "class": "SimpleItemText",
                "text": "As we shared last weekend, we have engaged a third-party victim advocate, Melodie Bissell, to independently and confidentially receive any concerns or allegations of sexual misconduct (including sexual abuse, sexual harassment, or abuse of power or authority) by a pastor, staff member, or lay leader within The Meeting House, whether current or historical."
              },
              {
                "class": "SimpleItemText",
                "text": "Melodie has received new allegations of sexual misconduct against Bruxy, unrelated to the previous investigation. Melodie has obtained permission from the two individuals who have come forward to notify the Overseers and the church community that the allegations have been made. These individuals are aware that their allegations have not yet been investigated. We take these initial allegations very seriously and will respond appropriately as more information is received."
              },
              {
                "class": "SimpleItemText",
                "text": "Maggie John - Chair of the Overseers Board"
              },
              {
                "class": "SimpleItemTextBold",
                "text": "March 12, 2022"
              },
              {
                "class": "SimpleItemText",
                "text": "The Overseers Board is committed to fostering a safe space for everyone at The Meeting House. As a tangible first step in the journey ahead, we have engaged a third-party victim advocate, Melodie Bissell, to independently and confidentially receive any concerns or allegations of sexual misconduct (including sexual abuse, sexual harassment, or abuse of power or authority) by a pastor, staff member, or lay leader within The Meeting House, whether current or historical."
              },
              {
                "class": "SimpleItemText",
                "text": "Melodie has extensive professional experience and academic credentials working with victims of sexual misconduct within church and ministry settings. She has provided guidance and wisdom to our Overseers Board in recent weeks as we have processed and communicated the findings and outcome of the independent external investigation pertaining to Bruxy Cavey."
              },
              {
                "class": "SimpleItemText",
                "text": "Melodie will provide, to any person who contacts her, confidential guidance and access to resources, including counseling resourcing and/or pastoral support in a victim-centric and trauma informed manner. She will also provide guidance to The Meeting House including, if the person consents, information to permit The Meeting House to take appropriate next steps."
              },
              {
                "class": "SimpleItemText",
                "text": "Our desire, as we follow Jesus, is to create a culture of honesty, accountability, and transparency, and to do everything possible to foster a safe and caring church community. There is no room for sexual misconduct in our church."
              },
              {
                "class": "SimpleItemText",
                "text": "The Overseers Board of The Meeting House encourages anyone who has experienced sexual misconduct by a pastor, staff member, or lay leader within The Meeting House to contact Melodie confidentially at: "
              },
              {
                "type": "link",
                "class": "SimpleItemLink",
                "text": "416-518-1058",
                "href": "tel:416-518-1058"
              },
              {
                "type": "link",
                "class": "SimpleItemLink",
                "text": "mbissell@traumacareconsulting.com",
                "href": "mailto:mbissell@traumacareconsulting.com"
              },
              {
                "type": "link",
                "class": "SimpleItemLink",
                "text": "Online referral form",
                "href": "https://form.jotform.com/220701021515538"
              },
              {
                "class": "SimpleItemText",
                "text": " "
              },
              {
                "class": "SimpleItemText",
                "text": "Anyone who reaches out to Melodie through these channels will receive a response within two days."
              },
              {
                "class": "SimpleItemTextBold",
                "text": "March 9, 2022"
              },
              {
                "class": "SimpleItemText",
                "text": "Due to the hundreds of questions we’ve received already, and the activity we’re seeing on social media, we’ve decided to host our Q & A Town Hall at the earliest opportunity."
              },
              {
                "class": "SimpleItemText",
                "text": "We invite you to join this live streamed event this Thursday at 7pm. You can continue to send your questions to the email below:"
              },
              {
                "type": "link",
                "class": "SimpleItemLink",
                "text": "townhall@themeetinghouse.com",
                "href": "mailto:townhall@themeetinghouse.com"
              },
              {
                "class": "SimpleItemText",
                "text": " "
              },
              {
                "class": "SimpleItemText",
                "text": "Maggie John, Chair of the Overseers Board"
              },
              {
                "class": "SimpleItemTextBold",
                "text": "March 8, 2022"
              },
              {
                "class": "SimpleItemText",
                "text": "We shared with our church community in early December that allegations of sexual misconduct were made against Bruxy Cavey. As soon as this information came to the attention of the Overseers Board, the Overseers put him on a leave of absence, and the church retained an external independent third-party investigator to conduct a thorough investigation into the allegations and to provide the Overseers Board with the findings."
              },
              {
                "class": "SimpleItemText",
                "text": "The investigator’s work is now complete. Over the last number of days, the Overseers have read the report and we have taken time to process the information and consider the required actions."
              },
              {
                "class": "SimpleItemText",
                "text": "The investigator determined that Bruxy had maintained a sexual relationship with the Victim, an adult woman, in violation of The Meeting House policy and the Handbook of Faith and Life of Be in Christ Church of Canada. The investigator also found that what became a sexual relationship between Bruxy and the Victim, which lasted over an extended period of time, constituted an abuse of Bruxy’s power and authority as a member of the clergy, and amounted to sexual harassment."
              },
              {
                "class": "SimpleItemText",
                "text": "Due to the seriousness of the investigator’s findings, our Board unanimously decided to ask Bruxy to resign from his role at The Meeting House effective immediately. Bruxy then submitted his resignation on March 3rd, which the Overseers accepted."
              },
              {
                "class": "SimpleItemText",
                "text": "The Meeting House stands against sexual misconduct, sexual harassment, and abuse of power and authority. We are praying through this situation."
              },
              {
                "class": "SimpleItemText",
                "text": "Maggie John - Chair of the Overseers Board"
              }  
            ]
          }
      ]
    }
}
  