{
    "page": {
      "name": "covid-19-response",
      "title": "Church Family Update",
      "keywords": "",
      "description": "",
      "pageConfig": {
        "showLive": true,
        "movingMenu": false,
        "showLogoText": false,
        "logoColor": "white",
        "showSearch": false,
        "showFooter": false,
        "showMenu": false,
        "isPopup": true,
        "navigateOnPopupClose": "/victimadvocacy"
      },
      "content": [
        {
          "type": "og-tags",
          "image": "/static/images/og-images/covid19.jpg",
          "url": "https://www.themeetinghouse.com/covid19",
          "title": "Update: Victim Advocacy Resource",
          "description": "Latest updates from The Meeting House."
        },
        {
          "type": "simple",
          "header1": "Church Family Update",
          "header2": "",
          "text": [
            {
              "class": "SimpleItemTextBold",
              "text": "May 21, 2022"
            },
            {
              "class": "SimpleItemText",
              "text": "On May 13th, we shared that more concerning allegations, unrelated to Bruxy Cavey, came to our attention."
            },
            {
              "class": "SimpleItemText",
              "text": "Recently, an individual contacted our victim advocate, Melodie Bissell, with allegations of sexual misconduct and abuse against former Senior Pastor, Tim Day, during his employment at The Meeting House. We take these allegations very seriously. When Melodie was given permission by the individual, we immediately informed legal counsel and have retained Natasha Persaud as an independent third party investigator to investigate these allegations."
            },
            {
              "class": "SimpleItemText",
              "text": "We grieve with all victims and are committed to taking all allegations of sexual misconduct seriously. We encourage anyone who thinks they may have experienced sexual misconduct or abuse by a pastor, staff member, or lay leader within The Meeting House to contact Melodie Bissell confidentially at:"
            },
            {
              "type": "link",
              "class": "SimpleItemLink",
              "text": "416-518-1058",
              "href": "tel:416-518-1058"
            },
  
            {
              "type": "link",
              "class": "SimpleItemLink",
              "text": "mbissell@traumacareconsulting.com",
              "href": "mailto:mbissell@traumacareconsulting.com"
            },
            {
              "type": "link",
              "class": "SimpleItemLink",
              "text": "Online referral form",
              "href": "https://form.jotform.com/220701021515538"
            },
            {
              "class": "SimpleItemText",
              "text": " "
            },
            {
              "class": "SimpleItemText",
              "text": "While we have limited information to share about this or the other investigations at this time, we would like to have some critical conversations as a church family, recognizing that we’re collectively carrying a heavy burden. We are hosting a community gathering on Tuesday, June 7th at 7:00pm to pray, grieve, and seek God’s direction, together. This will be in person at the Oakville site and live streamed for those who can’t make it in person."
            },
            {
              "class": "SimpleItemText",
              "text": "For our church, this is not an easy path. We are committed to better understanding our past so we can grieve, repent, be healed, and grow to be better stewards of Jesus’ love in the world."
            },
            {
              "class": "SimpleItemText",
              "text": "We also recognize that some of us will need a place to process further. Know that you can always reach out to your Lead Pastor. If you would like to speak to a counsellor, you can connect with one of the four professional counsellors we have provided here: themeetinghouse.com/tmhchurchcounselling."
            },
            {
              "class": "SimpleItemText",
              "text": "Please continue to pray with us for the healing of victims and that God would continue to work in and through our church. We will communicate further as we are able."
            },
            {
              "class": "SimpleItemTextBold",
              "text": "March 9, 2022"
            },
            {
              "class": "SimpleItemText",
              "text": "March 9 - Due to the hundreds of questions we’ve received already, and the activity we’re seeing on social media, we’ve decided to host our Q & A Town Hall at the earliest opportunity."
            },
            {
              "class": "SimpleItemText",
              "text": "We invite you to join this live streamed event this Thursday at 7pm. You can continue to send your questions to townhall@themeetinghouse.com."
            },
            {
              "class": "SimpleItemText",
              "text": "Maggie John, Chair of the Overseers Board"
            },
            {
              "class": "SimpleItemTextBold",
              "text": "March 8, 2022"
            },
            {
              "class": "SimpleItemText",
              "text": "We shared with our church community in early December that allegations of sexual misconduct were made against Bruxy Cavey. As soon as this information came to the attention of the Overseers Board, the Overseers put him on a leave of absence, and the church retained an external independent third-party investigator to conduct a thorough investigation into the allegations and to provide the Overseers Board with the findings."
            },
            {
              "class": "SimpleItemText",
              "text": "The investigator’s work is now complete. Over the last number of days, the Overseers have read the report and we have taken time to process the information and consider the required actions."
            },
            {
              "class": "SimpleItemText",
              "text": "The investigator determined that Bruxy had maintained a sexual relationship with the Victim, an adult woman, in violation of The Meeting House policy and the Handbook of Faith and Life of Be in Christ Church of Canada. The investigator also found that what became a sexual relationship between Bruxy and the Victim, which lasted over an extended period of time, constituted an abuse of Bruxy’s power and authority as a member of the clergy, and amounted to sexual harassment."
            },
            {
              "class": "SimpleItemText",
              "text": "Due to the seriousness of the investigator’s findings, our Board unanimously decided to ask Bruxy to resign from his role at The Meeting House effective immediately. Bruxy then submitted his resignation on March 3rd, which the Overseers accepted."
            },
            {
              "class": "SimpleItemText",
              "text": "The Meeting House stands against sexual misconduct, sexual harassment, and abuse of power and authority. We are praying through this situation."
            },
            {
              "class": "SimpleItemText",
              "text": "Maggie John - Chair of the Overseers Board of The Meeting House"
            }
          ]
        }
      ]
    }
  }
  