{
    "page": {
      "name": "Community Gathering",
      "title": "Community Gathering",
      "keywords": "",
      "description": "",
      "pageConfig": {
        "showLive": true,
        "movingMenu": false,
        "showLogoText": false,
        "logoColor": "white",
        "showSearch": false,
        "showFooter": false,
        "showMenu": false,
        "isPopup": true,
        "navigateOnPopupClose": "/"
      },
      "content": [
        {
          "type": "og-tags",
          "image": "/static/images/og-images/covid19.jpg",
          "url": "https://www.themeetinghouse.com/covid19",
          "title": "Community Gathering June 7",
          "description": "Join us as we gather as a community on June 7."
        },
        {
          "type": "simple",
          "header1": "Community Gathering June 7",
          "header2": "",
          "text": [
            {
              "class": "SimpleItemText",
              "text": "Now more than ever, it’s important for us to come together as a community of Jesus-followers to centre on Jesus and seek out where God is leading us."
            },
            {
              "class": "SimpleItemText",
              "text": "Join us on Tuesday, June 7th from 7:00 – 8:30 PM as we worship and pray, take stock of where we are as a church, and share where we sense God is calling us together in this season. We will also have time afterwards for those who wish to connect and chat further."
            },
            {
              "class": "SimpleItemText",
              "text": "While we plan to review a summary of the ongoing investigations and host a brief Q & A, our time will be focused on prayerfully committing to the difficult work of understanding and learning from our history as a church (the pain and the beauty), and charting our next steps together."
            },
            {
              "class": "SimpleItemText",
              "text": "If you have questions you hope to have addressed on Tuesday, please send them to leadership@themeetinghouse.com. We will do our best to answer the most commonly asked questions and follow up by email with any that we can’t address due to time constraints."
            },
            {
              "class": "SimpleItemText",
              "text": "This gathering is about coming together as a church family and centering on Jesus; we hope you will join us in person so we can better connect with one another. For those unable to attend in person, the gathering will also be live streamed so you can still join in. The details are below."
            },
            {
              "class": "SimpleItemText",
              "text": "Tuesday, June 7, from 7:00pm—8:30pm at The Meeting House Oakville, 2700 Bristol Circle, Oakville, L6H 6E1. The doors will be open at 6:30 PM. Please enter through the West entrance, grab a nice hot cup of coffee, and we will gather together in the theatre. "
            },
            {
                "class": "SimpleItemText",
                "text": "If you are unable to attend in person, we will be livestreaming the gathering at the link below. You can click it now if you know you won't be able to attend in order to add it to your calendar."
            },
            {
              "type": "link",
              "class": "SimpleItemLink",
              "text": "Livestream Link",
              "href": "https://youtu.be/TOypJQmumEM"
            }
          ]
        }
      ]
    }
  }
  