{
    "page": {
        "name": "community",
        "title": "Community",
        "keywords": "",
        "description":"",

        "pageConfig": {
            "movingMenu": false,
            "showLogoText": true,
            "logoColor":"black",
            "showSearch":true,
            "showFooter":true,
            "showMenu":true
        },
        "content": [
            {
                "type": "hero",
                "style": "full",
                "image1": [
                    {
                        "src": "/static/images/community-1.jpg",
                        "alt": "Two people talking at a kitchen counter, drinking tea"
                    }
                ],
                "header1": "Community",
                "header2": "",
                "text1": "At our core, we believe that we are created for relationship with God and with each other. When we come together in our local neighbourhoods and invite others in something powerful happens. Ready to meet some new friends and build new relationships?"
              
            },
            {
                "type": "content",
                "style": "oneImageBlackRight",
                "header1": "Nik's Story",
                "header2": "",
                "text1": "“When I look around and say the word 'love', I see Jesus. And I just want to live a loving and serving life.” Nik doesn’t come from a Christian background, and his childhood experiences drove him away from religion. See Nik’s story and his spiritual journey.",
                
                "list": [
                    {
                        "type":"link",
                        "title": "Watch Nik's Story",
                        "navigateTo": "life-stories"
                    }
                ],
                "image1": [
                    {
                        "src": "/static/images/community-2.jpg",
                        "alt": "Man standing in front of blackboard with equations on it"
                    }
                ]
            },
            
            {
                "type":"list",
                "style":"horizontal",
                "class":"videos",
                "subclass":"life-story",
                "selector":"all",
                "sortOrder":"DESC",
                "header1":"More Stories"                
            },
            {
                "type": "list",
                "style": "imageList",
                "header1": "Come Join Us",
                "list": [
                    {
                        "title": "Sunday Morning",
                        "text": "Want to join us this Sunday but aren’t sure what to expect? We gather to hang out and learn how we can grow as followers of Jesus through music, teaching, and volunteering. This is what we call church: the gathering of a people with a purpose.",
                        "imageSrc": "/static/images/community-3-1.jpg",
                        "imageAlt": "Three people standing by the doors of the Oakville site",
                        "navigateTo": "find-sunday-morning"
                    },
                    {
                        "title": "Home Church",
                        "text": "During the week, we meet in homes to further study and apply Sunday’s teaching, build relationships in smaller groups, and care for our local neighbourhoods. We call this Home Church—and it’s kind of the best thing we’ve got going.",
                        "imageSrc": "/static/images/community-3-2.jpg",
                        "imageAlt": "Three people sitting around a dining room table eating snacks",
                        "navigateTo": "find-home-church"
                    },
                    {
                        "title": "Kids & Youth",
                        "text": "We work together to create a safe community where our kids and youth can learn to love and follow Jesus. We do this through building relationships, equipping parents, and developing our own curriculum. Learn more about our programs.",
                        "imageSrc": "/static/images/community-3-3.jpg",
                        "imageAlt": "Two kids smiling",
                        "navigateTo": "teaching-kids-youth"
                    }
                ]
            }
           
        ]
    }
}