{
    "page": {
        "name": "community",
        "title": "Community",
        "keywords": "",
        "description":"",

        "pageConfig": {
            "movingMenu": false,
            "showLogoText": true,
            "logoColor":"black",
            "showSearch":true,
            "showFooter":true,
            "showMenu":true
        },
        "content": [
            {
                "type": "hero",
                "style": "partial",
                "image1": [
                    {
                        "src": "/static/images/TODO.jpg",
                        "alt": "TODO"
                    }
                ],
                "header1": "Community",
                "header2": "",
                "text1": "At our core, we believe that we are created for relationship with God and with each other. When we come together in our local neighbourhoods and invite others in something powerful happens. Ready to meet some new friends and build new relationships?"
              
            },
            {
                "type": "content",
                "style": "oneImageBlackRight",
                "header1": "Nick's Story",
                "header2": "",
                "text1": "“When I look around and say the word love I see Jesus. And I just want to live a loving and serving life.” Nick doesn’t come from a Christian background, and his childhood experiences drove him away from religion. See Nick’s story and his spiritual journey.",
                "link1Text": "More Community Stories",
                "link1Action": "life-stories",
                "image1": [
                    {
                        "src": "/static/images/TODO.jpg",
                        "alt": "TODO"
                    }
                ]
            },
            
            {
                "type":"list",
                "style":"horizontal",
                "class":"videos",
                "subclass":"life-story",
                "selector":"all",
                "sortOrder":"DESC",
                "header1":"More stories"                
            },
            {
                "type": "list",
                "style": "imageList",
                "header1": "Come join us",
                "list": [
                    {
                        "title": "Sunday Morning",
                        "text": "We gather to hang out and learn how we can grow as followers of Jesus through music, teaching, and volunteering. This is what we call church: the gathering of a people with a purpose. Planning on joining us this Sunday but aren’t sure what to expect?",
                        "imageSrc": "/static/images/TODO.jpg",
                        "imageAlt": "TODO",
                        "navigateTo": "sunday-morning"
                    },
                    {
                        "title": "Home Church",
                        "text": "During the week, we meet in homes to further study and apply Sunday’s teaching, build relationships in smaller groups, and care for our local neighbourhoods. We call this home church—and it’s kind of the best thing we’ve got going.",
                        "imageSrc": "/static/images/TODO.jpg",
                        "imageAlt": "TODO",
                        "navigateTo": "home-church"
                    },
                    {
                        "title": "Kids & Youth",
                        "text": "We work together to create a safe environment where our kids and youth can learn to love and follow Jesus. Kidmax is our Sunday morning children’s program for infants to grade 5, and runs in tandem with our Sunday morning service. For students grades 6 to 12, our youth program includes both a Sunday morning portion and a midweek gathering. Learn more about our programs, curriculum, and how to register.",
                        "imageSrc": "/static/images/TODO.jpg",
                        "imageAlt": "TODO",
                        "navigateTo": "kids+youth"
                    },
                    {
                        "title": "Make a Difference",
                        "text": "Another way that people can get connected to community is through our compassion or volunteer opportunities. This module should give a super brief introduction to how these opportunities are one way to get connected with other people and then contain a link to the Make a Difference webpage",
                        "imageSrc": "/static/images/TODO.jpg",
                        "imageAlt": "TODO",
                        "navigateTo": "make-a-difference"
                    }
                ]
            }
           
        ]
    }
}