{
    "page": {
        "name": "gospeltest",
        "title": "Gospel Cheat Sheet",
        "keywords": "",
        "description": "",
        "pageConfig": {
            "movingMenu": false,
            "showLogoText": false,
            "logoColor": "white",
            "showSearch": false,
            "showFooter": false,
            "showMenu": false,
            "isPopup": true,
            "navigateOnPopupClose": "/"
        },
        "content": [
            {
                "type": "simple",
                "header1": "March 12, 2020 – COVID-19 Response",
                "header2": "Since this is a changing situation please check back here for any updates.",
                "text": [
                    {
                        "class": "SimpleItemText",
                        "text": "In light of the rapidly developing situation around COVID-19, we realize that there is a lot of fear and uncertainty as we navigate the constantly changing stream of news and updates. This is a complicated time for our world and our communities."
                    },
                    {
                        "class": "SimpleItemText",
                        "text": "However, in all this we want to remain firmly grounded in the truth and fix our attention on Jesus. We do not make decisions out of fear but instead follow his example to love our neighbours and to care for those around us who may be more vulnerable. "
                    },
                    {
                        "class": "SimpleItemText",
                        "text": "This has led us, with information and recommendations provided by the Public Health Agency of Canada and concerns expressed by our church family, to consider a number of proactive measures. We want to be wise, caring, responsible, and compassionate during this uncertain time. "
                    },
                    {
                        "class": "SimpleItemText",
                        "text": "At this point in time, we are taking the following steps:"
                    },
                    {
                        "class": "SimpleItemTextBold",
                        "text": "Sunday Services"
                    },
                    {
                        "class": "SimpleItemText",
                        "text": "Our Sunday Services will continue this weekend. We are taking proactive steps to ensure our environments are as safe as possible. This means your experience will be a little different."
                    },
                    {
                        "class": "SimpleItemTextTab",
                        "text": "- Paper programs will not be handed out. You can find teaching notes on our website."
                    },
                    {
                        "class": "SimpleItemTextTab",
                        "text": "- We will not be distributing welcome packs. "
                    },
                    {
                        "class": "SimpleItemTextTab",
                        "text": "- Coffee and food will not be available. You’re still welcome to bring your own caffeine fix."
                    },
                    {
                        "class": "SimpleItemTextTab",
                        "text": "- Offering buckets will not be passed. Donations will be accepted at info tables, online, or by text. For ways to give, visit themeetinghouse.com/give. "
                    },
                    {
                        "class": "SimpleItemTextTab",
                        "text": "- Connect and welcome team volunteers will be greeting you with a smile instead of a handshake."
                    },
                    {
                        "class": "SimpleItemTextTab",
                        "text": "- We will be taking additional measures to sanitize and disinfect our Oakville location before and between services."
                    },
                    {
                        "class": "SimpleItemTextTab",
                        "text": "- We are in contact with Cineplex Entertainment and have been assured that they are taking additional steps to sanitize and disinfect the theatres we rent for our regional locations. More information is available on Cineplex’s website."
                    },
                    {
                        "class": "SimpleItemTextTab",
                        "text": "- We have distributed extra cleaning supplies and hand sanitizer to all of our locations. Our teams have been reminded to be extra vigilant in cleaning routines, including sanitization of gear in our Kidmax classrooms."
                    },
                    {
                        "class": "SimpleItemTextTab",
                        "text": "- We are asking anyone who is experiencing flu-like symptoms, or has reason to believe that they may have become exposed to COVID-19, to stay home."
                    },
                    {
                        "class": "SimpleItemTextTab",
                        "text": "- Our Sunday teaching will be available online via our website. For our regional sites, the video teaching and notes for week two of Speaking of Jesus are available now. For Oakville, we will be live-streaming both the 9: 30am and 11: 15am services at themeetinghouse.com. "
                    },
                    {
                        "class": "SimpleItemTextBold",
                        "text": "Midweek Events, Youth, and Home Church"
                    },
                    {
                        "class": "SimpleItemText",
                        "text": "All Youth midweek programming, local community events (such as dinners and Movie Mania), and any additional special events and ministries are cancelled until March 31. For more specific local information please contact your lead pastor."
                    },
                    {
                        "class": "SimpleItemText",
                        "text": "All in-person Home Church gatherings will be paused, and we are encouraging our Home Church elders to transition to online options, until March 31. For more information, please contact your lead pastor or Home Church elder."
                    },
                    {
                        "class": "SimpleItemText",
                        "text": "While we are making these changes and taking precautionary measures, we are not shutting down our mission or compromising our purpose and vision. "
                    },
                    {
                        "class": "SimpleItemText",
                        "text": "This is an opportunity for our mission to take a different form. We want to use digital tools and media to engage in online community building, supporting not only our church family but connecting with others who are isolated and aren’t able to engage in community and fellowship."
                    },
                    {
                        "class": "SimpleItemText",
                        "text": "We want to be a church that is always moving forward and reaching people in every context. We know that God will use what we have to continue building his kingdom as we seek to introduce spiritually curious people to the Jesus-centred life."
                    },
                    {
                        "class": "SimpleItemText",
                        "text": "We pray for God’s provision, leading, and the wisdom of the Holy Spirit during this situation. We pray for the health and safety of our church, our cities, our neighbours, and our world. And we continue to pray for Spirit-led courage and creativity as we ask God to use us to serve and love people well. "
                    }
                    
                ]
                

                



     }
        ]
    }
}