{
    "page": {
        "name": "go",
        "title": "Go Campaign",
        "keywords": "",
        "description":"",

        "pageConfig": {
            "movingMenu": false,
            "showLogoText": true,
            "logoColor":"black",
            "showSearch":true,
            "showFooter":true,
            "showMenu":true
        },
        "content": [
            {
                "type": "hero",
                "style": "full",
                "image1": [
                    {
                        "src": "/static/images/community-1.jpg",
                        "alt": "Description"
                    }
                ],
                "header1": "Go Campaign",
                "header2": "",
                "text1": "We are a movement driven by Jesus’ command: “to go and make disciples” but the world is changing. The Go Campaign is our response, our choice to grow, evolve and innovate so we can continue to introduce people to the Jesus-centred life and to be the church that God called us to be.",
                "button1Text": "Explore Spirituality",
                "button1Action": "spirituality"
            },
            {
                "type": "content",
                "style": "oneImage",
                "header1":"Pledge",
                "header2":"",
                "text1":"We are our best selves when we don’t make it all about ourselves. As The Meeting House, we follow the counter cultural example of the early church, to care for and love others before ourselves, and trust that as we do this God will meet our needs. This is who we have always been and everyone who is a part of our church community today is a recipient of the radical other centred generosity of the previous generation. The Go Campaign is our response to our changing society. Our choice to be other-centred and radically generous by investing in new ideas and innovation, technology and resources, training and people who will reinvent and reshape what evangelism could be to enable thousands to engage in the good news message.",
                "link1Text": "Give Now",
                "link1Action": "give",
                "link1Text": "Go",
                "link1Action": "go-pledge",
                "image1":[{
                    "src":"/static/images/homepage-2.jpg",
                    "alt":"TODO"
                }]

            }
        ]
    }
}