{
    "page": {
        "name": "homepage",
        "title": "The Meeting House - Welcome",
        "keywords": "Church, Toronto, Anabaptist, Christian, Jesus, Home church, Bruxy, Be In Christ, Spirituality, Christianity",
        "description":"Homepage for The Meeting House",
        "pageConfig": {
            "movingMenu": true,
            "showLogoText": true,
            "logoColor":"black",
            "showSearch":true,
            "showFooter":true,
            "showMenu":true,
            "showLive":true,
            "weatherAlert":false
        },
        "content": [
            {
                "type": "hero",
                "style": "full",
                "image1": [
                    {
                        "src": "/static/images/homepage-1-1.jpg",
                        "alt": "Man sitting outside on a backyard patio talking and laughing with a group of friends.."
                    },
                    {
                        "src": "/static/images/homepage-1-2.jpg",
                        "alt": "Young man talking to his friend outside a church building."
                    },
                    {
                        "src": "/static/images/homepage-1-3.jpg",
                        "alt": "Young woman sitting at a table with her friends smiling and talking during home church."
                    },
                    {
                        "src": "/static/images/homepage-1-4.jpg",
                        "alt": "Young woman in glasses smiling and speaking with a friend."
                    },
                    {
                        "src": "/static/images/homepage-1-5.jpg",
                        "alt": "Two men talking outside on a backyard patio."
                    },
                    {
                        "src": "/static/images/homepage-1-6.jpg",
                        "alt": "Young woman talking to a friend outside on a backyard patio."
                    },
                    {
                        "src": "/static/images/homepage-1-7.jpg",
                        "alt": "Young woman in a hat and winter coat is laughing and talking to a friend."
                    }
                ],
                "header1": "Hello Friend",
                "text1": "When’s the last time someone asked you what you believe? You know—about the big things in life. We’re a church that loves to ask questions, and loves people with questions. We don’t have all the answers, but exploring together is pretty much our favourite thing.",
                "button1Text": "Explore Spirituality",
                "button1Action": "/spirituality"
            },
            {
                "type": "content",
                "style": "oneImage",
                "header1": "Loneliness Sucks",
                "text1": "Community is a party and we want to make sure everyone's invited. Ready to connect with people who want to care for their neighbourhoods?",
                "list": [
                    {
                        "type":"link",
                        "title": "Find Community",
                        "navigateTo": "/community"
                    }
                ],
              
                "image1": [
                    {
                        "src": "/static/images/homepage-2-new.jpg",
                        "alt": "Group of friends from church sitting together and talking."
                    }
                ]
            },
            {
                "type": "content",
                "style": "oneImageBlackRight",
                "header1": "Peacemakers",
                "header2": "",
                "text1": "This is our opportunity to work towards peace and justice in some of the most vulnerable communities around the world. As the church, we journey with people who have been marginalized through violence by working to meet their tangible needs.",
                "list": [
                    {
                        "type":"link",
                        "title": "Become a Peacemaker",
                        "navigateTo": "/peacemakers"
                    }
                ],
              
                "image1": [
                    {
                        "src": "/static/images/peacemakers-1.jpg",
                        "alt": "Man sharing First Nations peace practices and rituals with a group."
                    }
                ]
            },
           
            {
                "type": "list",
                "style": "imageList",
                "header1": "Teaching",
                "text1": "Explore the life and teaching of Jesus as well as practical applications for your daily life.",
                "list": [
                    {
                        "title": "Sunday Teaching",
                        "text": "The video from our live Sunday services, including notes, questions, audio and additional content. Check out what we're learning, or search through various topics in our teaching archive.",
                        "imageSrc": "/static/images/homepage-4-1-new.jpg",
                        "imageAlt": "Young woman sitting at a table and looking at her notes from Sunday teaching at The Meeting House.",
                        "navigateTo": "/teaching"
                    },
                    {
                        "title": "Podcasts",
                        "text": "All of our Sunday teaching in one place. We've also got The After Party podcast where we chat with special guests about theology and culture and The Roundtable podcast where we discuss church life with our leaders, staff, and special guests.",
                        "imageSrc": "/static/images/homepage-4-2-new.jpg",
                        "imageAlt": "Team of pastors from The Meeting House sitting around a table and recording a podcast.",
                        "navigateTo": "/teaching-podcasts"
                    },
                    {
                        "title": "Videos",
                        "text": "Our video library featuring stories of people and communities who show us what it looks like to live the Jesus-centred life.",
                        "imageSrc": "/static/images/homepage-4-3-new.jpg",
                        "imageAlt": "Production volunteer recording a Meeting House video.",
                        "navigateTo": "/teaching-curated"
                    },
                    {
                        "title": "Kids & Youth Curriculum",
                        "text": "Through Sunday morning teaching, midweek group resources, and The Parent Blog, our kids and youth curriculum is designed to partner with parents and leaders and equip them with resources to disciple their kids and youth well.",
                        "imageSrc": "/static/images/homepage-4-4-new.jpg",
                        "imageAlt": "Kids gathering around a smartphone to watch a video from The Meeting House Kids and Youth curriculum.",
                        "navigateTo": "/teaching-kids-youth"
                    }
                ]
            },
            {
                "type": "list",
                "style": "twoImage",
                "header1": "Recent Blog Entries",
                "header2": ".",
                "text1": "Part of being a disciple of Jesus is actually taking action and making a difference in this world. We do this through compassion initiatives where we love our neighbours both close and far away, volunteering and giving financially to support the work of our church and other kingdom projects.",
                "button1Text": "View All Blogs",
                "button1Action": "/blogs"
            },
            {
                "type": "content",
                "style": "oneImage",
                "header1": "Make a Difference",
                "header2": "",
                "text1": "Volunteering, giving, and compassion around the block or around the world. We want to use our money, time, and resources to love and serve people on the margins. Are you looking to get involved?",
               
                "list": [
                    {
                        "type":"link",
                        "title": "Volunteering",
                        "navigateTo": "/volunteering"
                    },
                    {
                        "type":"link",
                        "title": "Compassion",
                        "navigateTo": "/compassion"
                    },
                    {
                        "type":"link",
                        "title": "Giving",
                        "navigateTo": "/give"
                    }
                ],
              
                "image1": [
                    {
                        "src": "/static/images/homepage-6-new.jpg",
                        "alt": "Friends walking together across the street talking about volunteering, compassion, and giving at The Meeting House."
                    }
                ]
            },
            {
                "type": "content",
                "style": "oneImageBlackRight",
                "header1": "Go Campaign",
                "header2": "",
                "text1": "We're our best selves when we don't make it all about ourselves. We're beginning the next chapter of our story to go and engage people who have never meaningfully encountered the gospel—and we've got a plan. ",
                "list": [
                    {
                        "type":"link",
                        "title": "Let's Do This",
                        "navigateTo": "/go"
                    }
                ],
              
                "image1": [
                    {
                        "src": "/static/images/homepage-3-new-update.jpg",
                        "alt": "Group of friends hanging out at The Meeting House church talking about our Go campaign."
                    }
                ]
            },
            {
                "type": "hero",
                "style": "partialNoFooter",
                "image1": [
                    {
                        "src": "/static/svg/Map.svg",
                        "alt": "A map representing locations of The Meeting House churches."
                    }
                ],
                "header1": "Locations",
                "text1": "It's pretty simple: we get together each week to hang out, build relationships, and find ways to love and serve our local communities as we learn to follow Jesus.",
                "text2": "What are you doing this Sunday?",
                "link1Text": "Show Map",
                "link1Action": "/find-sunday-morning",
                "class":"locations",
                "showLocationSearch": true
            }
        ]
    }
}