{
    "page": {
        "name": "home-church",
        "title": "Home Church",
        "keywords": "",
        "description":"",

        "pageConfig": {
            "movingMenu": false,
            "showLogoText": true,
            "logoColor":"black",
            "showSearch":true,
            "showFooter":true,
            "showMenu":true
        },
        "content": [
           
            {
                "type": "hero",
                "style": "full",
                "image1": [
                    {
                        "src": "/static/images/TODO.jpg",
                        "alt": "TODO"
                    }
                ],
                "header1": "Andrea’s Story",
                "header2": "",
                "text1": "We believe something really good happens when we intentionally come together in our neighbourhoods to share life, grow deeper spiritual friendships, and create an open dialogue about how we can live the Jesus-centred life."
              
            },
            {
                "type": "content",
                "style": "greyTwoText",
                "header1":"What is Home Church?",
                "header2":"",
                "text1":"We meet during the week in homes to develop relationships, further study and apply Sunday’s teaching, and care for our neighbourhoods. All of our Home Churches are open and welcoming to new friends and visitors. You can even show up this week and jump right in! It's a casual vibe with snacks, discussion, prayer, and the opportunity to ask questions and talk about practical applications. Our Home Churches are made up of even smaller groups called huddles. We believe discipleship is most fully realized in the small authentic community of a Home Church huddle where we can develop rich and healthy relationships with fellow disciples of Jesus.",
                "list": [
                    {
                        "type":"link",
                        "title": "Find a Home Church",
                        "navigateTo": "find-home-church"
                    }
                ]
            
            },
            {
                "type": "content",
                "style": "oneImageBlackRight",
                "header1": "Family Friendly",
                "header2": "",
                "text1": "Some Home Churches are designed with the entire family in mind. Kids and youth are welcome to join. Home Church leaders will tailor discussion to include kids and youth, or create space where they can participate with friends their age and apply the teaching in a relevant way.",
                
               
                "image1": [
                    {
                        "src": "/static/images/Todo.jpg",
                        "alt": "Todo"
                    }
                ]
            }
        ]
    }
}