{
    "page": {
        "name": "homechurch",
        "title": "Home Church",
        "keywords": "",
        "description":"",

        "pageConfig": {
            "movingMenu": false,
            "showLogoText": true,
            "logoColor":"black",
            "showSearch":true,
            "showFooter":true,
            "showMenu":true
        },
        "content": [
            {
                "type": "og-tags",
                "image": "/static/images/homechurch-1-1.jpg",
                "url": "https://www.themeetinghouse.com/homechurch",
                "title": "Home Church",
                "description": ""
            },
            {
                "type": "hero",
                "style": "full",
                "image1": [
                    {
                        "src": "/static/images/homechurch-1-1.jpg",
                        "alt": "Three friends talking together around a kitchen table during home church."
                    }
                ],
                "header1": "Home Church",
                "header2": "",
                "text1": "We believe something really good happens when we intentionally come together in our neighbourhoods to share life, grow deeper spiritual friendships, and create an open dialogue about how we can live the Jesus-centred life.",
                "button1Text": "Watch Andrea's Story",
                "button1Action": "/videos/spiritually-curious-Spiritually%20Curious/SP3pD2plP04"
            },
            {
                "type": "content",
                "style": "greyTwoText",
                "header1":"What is Home Church?",
                "header2":"",
                "text1":"We meet during the week in homes to develop relationships, study and apply Sunday’s teaching, and care for our neighbourhoods. Home Churches are open and welcoming to new friends and visitors; you can show up this week and jump right in! It's a casual vibe with snacks, discussion, prayer, and the opportunity to ask questions. Our Home Churches are made up of even smaller groups called huddles. We believe discipleship is most fully realized in the small authentic community of a Home Church huddle where we can develop rich and healthy relationships with fellow disciples of Jesus.",
                "list": [
                    {
                        "type":"link",
                        "title": "Find a Home Church",
                        "navigateTo": "/find-home-church"
                    }
                ]
            
            },
            {
                "type": "content",
                "style": "oneImage",
                "header1": "Online Home Church",
                "header2": "",
                "text1": "As a result of COVID-19, our home churches have transitioned to online gatherings. If you're looking to connect with community online now's a better time than ever! Find a home church and connect with its leader for more details.",
                "list": [
                    {
                        "type":"link",
                        "title": "Home Church Search",
                        "navigateTo": "find-home-church"
                    }
                ],
                "image1": [
                    {
                        "src": "/static/images/corona-3.jpg",
                        "alt": "A group of friends connecting online using video chat."
                    }
                ]
            },
            {
                "type": "content",
                "style": "oneImageBlackRight",
                "header1": "Family Friendly",
                "header2": "",
                "text1": "Some Home Churches are designed with the entire family in mind, so kids and youth are welcome to join. Home Church leaders will help tailor the discussion to include everyone or create space where kids can learn and participate with friends their age.",
                
               
                "image1": [
                    {
                        "src": "/static/images/homechurch-2-1.jpg",
                        "alt": "Parents and children together at home church."
                    }
                ]
            }
        ]
    }
}