{
    "page": {
      "name": "June 17 Community Update",
      "title": "June 17 Community Update",
      "keywords": "",
      "description": "",
      "pageConfig": {
        "showLive": true,
        "movingMenu": false,
        "showLogoText": false,
        "logoColor": "white",
        "showSearch": false,
        "showFooter": false,
        "showMenu": false,
        "isPopup": true,
        "navigateOnPopupClose": "/victimadvocacy"
      },
      "content": [
        {
          "type": "og-tags",
          "image": "/static/images/og-images/covid19.jpg",
          "url": "https://www.themeetinghouse.com/june17-communityupdate",
          "title": "June 17 Update",
          "description": "June 17 Update from The Meeting House."
        },
        {
          "type": "simple",
          "header1": "June 17, 2022",
          "header2": "",
          "text": [
            {
              "class": "SimpleItemText",
              "text": "Our Senior Leadership Team and Board of Overseers are committed to regular, informative, and transparent communication throughout this season. You can expect an update email at least once per month, in addition to other touchpoints."
            },
            {
              "class": "SimpleItemTextBold",
              "text": "Victim Advocacy"
            },
            {
              "class": "SimpleItemText",
              "text": "At the Gathering, we shared that, to date, Melodie Bissell, our Victim Advocate has received 38 referrals. Since sharing this information, we’ve received several questions about that number and we want to give further clarification."
            },
            {
              "class": "SimpleItemText",
              "text": "The 38 referrals are not unique sets of sexual misconduct allegations. They represent allegations, disclosures, and concerns relating primarily to clergy sexual misconduct, harassment, and abuse by a number of former pastors and church leaders."
            },
            {
              "class": "SimpleItemText",
              "text": "Some of the allegations made in the 38 referrals are repeated more than once; the Victim Advocate prepares a report with desired outcomes for each person who contacts her. This means that there are not 38 separate allegations. Melodie also gives each person options that are available to them if they wish to escalate the matter. Each report is then read by the Victim Advocacy Committee of The Board of Overseers to determine appropriate next steps."
            },
            {
              "class": "SimpleItemText",
              "text": "Some of the allegations relate to former youth pastors, Kie Naidoo and Dave Churchill. We were already aware of some of those allegations. Kie Naidoo and Dave Churchill have not worked at our church for a number of years."
            },
            {
                "class": "SimpleItemText",
                "text": "Some of the allegations are against Bruxy Cavey. As you are aware, there is one ongoing investigation into allegations against Bruxy (made by three different women). At this stage, these are allegations only. They are currently being investigated and no findings will be concluded until the investigation is complete."
            },
            {
              "class": "SimpleItemText",
              "text": "Some of the allegations include sexual misconduct allegations against former Senior Pastor, Tim Day. At this stage, these are allegations only. They are currently being investigated and no findings will be concluded until the investigation is complete."
          },
          {
            "class": "SimpleItemText",
            "text": "A number of referrals are from people who have felt that the church did not, in the past, respond properly when they came forward with allegations of sexual misconduct. The Victim Advocate has been an important channel for people who feel hurt by our church. We grieve with all victims and are committed to taking allegations of sexual misconduct seriously. We welcome all voices as we continue to journey on the path of bringing the truth to light."
          },
          {
            "class": "SimpleItemText",
            "text": "There are also referrals that have come in to the Victim Advocate that relate to matters other than sexual misconduct, abuse, or harassment. For instance, some community members have used this channel to share concerns they had regarding relational breakdowns within their local communities."
          },
          {
            "class": "SimpleItemText",
            "text": "We encourage anyone who thinks they may have experienced sexual misconduct or abuse by a pastor, staff member, or lay leader within The Meeting House to contact Melodie Bissell confidentially below:"
          },
          {
            "type": "link",
            "class": "SimpleItemLink",
            "text": "416-518-1058",
            "href": "tel:416-518-1058"
          },
          {
            "type": "link",
            "class": "SimpleItemLink",
            "text": "mbissell@traumacareconsulting.com",
            "href": "mailto:mbissell@traumacareconsulting.com"
          },
          {
            "type": "link",
            "class": "SimpleItemLink",
            "text": "Online referral form",
            "href": "https://form.jotform.com/220701021515538"
          },
          {
            "class": "SimpleItemTextBold",
            "text": "Care and Healing"
          },
          {
            "class": "SimpleItemText",
            "text": "Understanding and telling our story is necessary in order to truly come to the place of repentance and healing; this process takes time, effort, and patience to conduct properly, authentically, and well. We shared about an approach to telling our story that involves learning, taking ownership, lamenting, repenting, healing, and restoration so we can move forward humbly and more like Jesus. We are currently reviewing proposals from people who might be able to partner with us through this process, and we believe this long and difficult work will be key to moving forward as a church."
          },
          {
            "class": "SimpleItemText",
            "text": "We trust this information is helpful. Thank you for praying with us and walking this journey together as we fix our eyes on Jesus."
          }
          ]
        }
      ]
    }
  }
  