{
    "page": {
        "name": "kids-and-youth",
        "title": "Kids and Youth",
        "keywords": "",
        "description":"",

        "pageConfig": {
            "movingMenu": false,
            "showLogoText": true,
            "logoColor":"black",
            "showSearch":true,
            "showFooter":true,
            "showMenu":true
        },
        "content": [
            {
                "type": "hero",
                "style": "full",
                "image1": [
                    {
                        "src": "/static/images/KidsYouth_hero.jpg",
                        "alt": "Large group of youth having fun throwing powder paint in the air at a youth retreat."
                    }
                ],
                "header1": "Kids and Youth",
                "header2": "",
                "text1": "We love kids and youth. And because of that we highly value the time we are able to be with them. We use our own Jesus-centred curriculum to help our kids and youth learn to love and follow Jesus in a safe and welcoming environment."
              
            },
            {
                "type": "content",
                "style": "greyTwoText",
                "header1":"Kids",
                "header2":"Infant - Grade 5",
                "text1":"We use our own Jesus-centred curriculum to help kids and youth learn to love and follow Jesus in a safe and welcoming environment."
            
            },
            {
                "type": "content",
                "style": "greyTwoText",
                "header1":"Youth",
                "header2":"Grades 6 - 12",
                "text1":"We walk alongside our youth as they learn to love and follow Jesus, sharing his message with others. Our Junior High program (grades 6-8) consists of Sunday morning gatherings during our services, as well as a midweek gathering. Our Senior High students (grades 9-12) remain in the service on Sundays and gather midweek for teaching and small groups. We use our own Jesus-centred youth curriculum and provide our youth with opportunities to build relationships, talk about Jesus, and engage in their community."
            
            },
            {
                "type": "content",
                "style": "oneImage",
                "header1": "Curriculum?",
                "text1": "Interested in using our curriculum? Visit our dedicated site for Sunday morning teaching, midweek resources, and The Parent Blog. ",
            
                "list": [
                    {
                        "type":"link",
                        "title": "Kids & Youth Curriculum",
                        "navigateTo": "http://kidsandyouth.themeetinghouse.com",
                        "openNewBrowser":true
                    }
                ],

                "image1": [
                    {
                        "src": "/static/images/KidsYouth_3.jpg",
                        "alt": "Group of friends from church sitting together and talking."
                    }
                ]
            },
            {
                "type": "content",
                "style": "greyTwoText",
                "header1":"Parents",
                "header2":"",
                "text1":"Kidmax is our Sunday morning program for infants to grade 5. We use our own Jesus-centred curriculum to help our kids learn to love and follow Jesus in a safe and welcoming environment. We also want to empower parents to be the primary spiritual caregivers of their children, so we provide weekly take-home materials with each lesson."
            
            }
        ]
    }
}