{
    "page": {
        "name": "kids-and-youth",
        "title": "Kids and Youth",
        "keywords": "",
        "description":"",

        "pageConfig": {
            "movingMenu": false,
            "showLogoText": true,
            "logoColor":"black",
            "showSearch":true,
            "showFooter":true,
            "showMenu":true
        },
        "content": [
            {
                "type": "hero",
                "style": "full",
                "image1": [
                    {
                        "src": "/static/images/kidsyouth-1-1.jpg",
                        "alt": "Large group of youth having fun throwing powder paint in the air at a youth retreat."
                    }
                ],
                "header1": "Kids and Youth",
                "header2": "",
                "text1": "We love kids and youth—and because of that we highly value the time we are able to be with them."
              
            },
            {
                "type": "list",
                "style": "imageList",
                "header1": "",
                "text1": "",
                "list": [
                    {
                        "title": "Kids",
                        "text": "Kidmax is the name of our kids program. We exist to help kids understand and live Jesus' message. Kids (infants to grade 5) hang out on Sunday mornings for activities and discussion from our curriculum. We use a small group model so kids can get to know one another and their leaders as they explore faith together. We work hard to create a safe community.",
                        "imageSrc": "/static/images/kidsyouth-2-1.jpg",
                        "imageAlt": "Man stands by the church doors welcoming people in."
                    },
                    {
                        "title": "Youth",
                        "text": " Our services begin with about 15 minutes of music, where we join together to sing songs about Jesus. There is a live band, and the lyrics are projected onto the screen. After this we share a few announcements and stories about what’s happening, followed by 40 minutes of Jesus-centred teaching. We’ve got notes and Bibles ready for you so you can follow along as we learn together.",
                        "imageSrc": "/static/images/kidsyouth-2-2.jpg",
                        "imageAlt": "Volunteer musician playing the drums during a Sunday morning service at The Meeting House."
                    },
                    {
                        "title": "Parents and Guardians",
                        "text": "Once the service is done, we typically hang out to chat, connect, and maybe have a snack. You are welcome to take off, or stay as long as you’d like. If you'd like someone to talk to or pray with, maybe even figure out some next steps, our pastors and volunteers are always around to meet new people.",
                        "imageSrc": "/static/images/sunday-morning-2-3.jpg",
                        "imageAlt": "Group of friends smiling and talking together."
                    }
                ],

                "image1": [
                    {
                        "src": "/static/images/KidsYouth_3.jpg",
                        "alt": "Group of friends from church sitting together and talking."
                    }
                ]
            },
            {
                "type": "content",
                "style": "greyTwoText",
                "header1":"Parents",
                "header2":"",
                "text1":"Kidmax is our Sunday morning program for infants to grade 5. We use our own Jesus-centred curriculum to help our kids learn to love and follow Jesus in a safe and welcoming environment. We also want to empower parents to be the primary spiritual caregivers of their children, so we provide weekly take-home materials with each lesson."
            
            }
        ]
    }
}