{
    "page": {
      "name": "May 13 Church Family Update",
      "title": "May 13 Church Family Update",
      "keywords": "",
      "description": "",
      "pageConfig": {
        "showLive": true,
        "movingMenu": false,
        "showLogoText": false,
        "logoColor": "white",
        "showSearch": false,
        "showFooter": false,
        "showMenu": false,
        "isPopup": true,
        "navigateOnPopupClose": "/victimadvocacy"
      },
      "content": [
        {
          "type": "og-tags",
          "image": "/static/images/og-images/covid19.jpg",
          "url": "https://www.themeetinghouse.com/may13-communityupdate",
          "title": "May 13 Community Update",
          "description": "Latest updates from The Meeting House."
        },
        {
          "type": "simple",
          "header1": "Church Family Update",
          "header2": "",
          "text": [
            {
              "class": "SimpleItemTextBold",
              "text": "May 13, 2022"
            },
            {
              "class": "SimpleItemText",
              "text": "At the end of March, we shared the news that two further allegations of sexual misconduct had been brought forward through our victim advocate, and that another investigation was underway at the request of the complainants. Since then, an additional allegation has come forward and been added to the new investigation. All of these allegations relate to Bruxy Cavey. We expect this investigation will proceed on a similar timeline to the first investigation. We’ll continue to update you as we are able."
            },
            {
              "class": "SimpleItemText",
              "text": "We’ve also started receiving other reports from our victim advocate, Melodie Bissell, which are unrelated to Bruxy Cavey. We’re thankful for the courageous women and men who have shared their stories of hurt and abuse. We’re humbled to now be the stewards of those stories. How we respond as a church matters. As we’re able, we’ll share more in the coming days. For now, we’re focused on listening to these stories from those who have carried such pain and felt unheard for too long. We’re committed to learning, understanding, and revealing truth—and to being and doing better. We’re working first to respond to their questions, updating our policies, and implementing best practices. We appreciate your prayers as we know we don’t have it all figured out. However, we do know that we want to be the kind of church we’ve always thought we were: loving like Jesus. We’ll need to do this work together."
            },
            {
              "class": "SimpleItemText",
              "text": "We grieve with all victims and are committed to taking all allegations of sexual misconduct seriously."
            },
            {
              "class": "SimpleItemText",
              "text": "Senior Leadership Team &amp; The Board of Overseers"
            }
          ]
        }
      ]
    }
  }
  