{
    "page": {
      "name": "May 21 Church Family Update",
      "title": "May 21 Church Family Update",
      "keywords": "",
      "description": "",
      "pageConfig": {
        "showLive": true,
        "movingMenu": false,
        "showLogoText": false,
        "logoColor": "white",
        "showSearch": false,
        "showFooter": false,
        "showMenu": false,
        "isPopup": true,
        "navigateOnPopupClose": "/victimadvocacy"
      },
      "content": [
        {
          "type": "og-tags",
          "image": "/static/images/og-images/covid19.jpg",
          "url": "https://www.themeetinghouse.com/may21communityupdate",
          "title": "May 21 Church Family Update",
          "description": "Latest updates from The Meeting House."
        },
        {
          "type": "simple",
          "header1": "Church Family Update",
          "header2": "",
          "text": [
            {
              "class": "SimpleItemTextBold",
              "text": "May 21, 2022"
            },
            {
              "class": "SimpleItemText",
              "text": "On May 13th, we shared that more concerning allegations, unrelated to Bruxy Cavey, came to our attention."
            },
            {
              "class": "SimpleItemText",
              "text": "Recently, an individual contacted our victim advocate, Melodie Bissell, with allegations of sexual misconduct and abuse against former Senior Pastor, Tim Day, during his employment at The Meeting House. We take these allegations very seriously. When Melodie was given permission by the individual, we immediately informed legal counsel and have retained Natasha Persaud as an independent third party investigator to investigate these allegations."
            },
            {
              "class": "SimpleItemText",
              "text": "We grieve with all victims and are committed to taking all allegations of sexual misconduct seriously."
            },
            {
              "class": "SimpleItemText",
              "text": "While we have limited information to share about this or the other investigations at this time, we would like to have some critical conversations as a church family, recognizing that we’re collectively carrying a heavy burden. We are hosting a community gathering on Tuesday, June 7th at 7:00pm to pray, grieve, and seek God’s direction, together. This will be in person at the Oakville site and live streamed for those who can’t make it in person."
            },
            {
              "class": "SimpleItemText",
              "text": "For our church, this is not an easy path. We are committed to better understanding our past so we can grieve, repent, be healed, and grow to be better stewards of Jesus’ love in the world."
            },
            {
              "class": "SimpleItemText",
              "text": "Please continue to pray with us for the healing of victims and that God would continue to work in and through our church. We will communicate further as we are able."
            }
          ]
        }
      ]
    }
  }
  