{
  "page": {
    "name": "sunday-morning",
    "title": "Sunday Morning",
    "keywords": "",
    "description": "",

    "pageConfig": {
      "movingMenu": false,
      "showLogoText": true,
      "logoColor": "black",
      "showSearch": true,
      "showFooter": true,
      "showMenu": true
    },
    "content": [
      {
        "type": "og-tags",
        "image": "/static/images/sunday-morning-1.jpg",
        "url": "https://www.themeetinghouse.com/sunday-morning",
        "title": "Sunday Morning",
        "description": ""
      },
      {
        "type": "hero",
        "style": "full",
        "image1": [
          {
            "src": "/static/images/sunday-morning-1.jpg",
            "alt": "Woman holding her infant and smiling at the camera."
          }
        ],
        "header1": "We Can't Wait for Sunday Morning",
        "header2": "",
        "text1": "We gather on Sundays across multiple locations for teaching, music, prayer, and volunteering. We make space for spiritual seekers to come and ask questions, connect with community, and explore faith."
      },
      {
        "type": "list",
        "style": "imageList",
        "header1": "What To Expect",
        "text1": "We keep it pretty simple. If you're hanging out with us this Sunday, here's what you can expect:",
        "list": [
          {
            "title": "Before",
            "text": "Our Sunday services are 60 minutes long. You can wear whatever clothing is comfortable. We’ve got coffee ready to go in the lobby, show up a few minutes early to grab a cup and find a seat. If you're with children, we've got a program for infants to grade 8, equipped with a check-in system and security cleared volunteers.",
            "imageSrc": "/static/images/sunday-morning-2-1.jpg",
            "imageAlt": "Man stands by the church doors welcoming people in."
          },
          {
            "title": "Music and Teaching",
            "text": "Our services begin with about 15 minutes of music, where we join together to sing songs about Jesus. There is a live band, and the lyrics are projected onto the screen. After this we share a few announcements and stories about what’s happening, followed by 40 minutes of Jesus-centred teaching. We’ve got notes and Bibles ready for you so you can follow along as we learn together.",
            "imageSrc": "/static/images/sunday-morning-2-2.jpg",
            "imageAlt": "Volunteer musician playing the drums during a Sunday morning service at The Meeting House."
          },
          {
            "title": "After",
            "text": "Once the service is done, we typically hang out to chat, connect, and maybe have a snack. You are welcome to take off, or stay as long as you’d like. If you'd like someone to talk to or pray with, maybe even figure out some next steps, our pastors and volunteers are always around to meet new people.",
            "imageSrc": "/static/images/sunday-morning-2-3.jpg",
            "imageAlt": "Group of friends smiling and talking together."
          }
        ]
      },
      {
        "type": "instagram"
      },

      {
        "type": "hero",
        "style": "partialNoFooter",
        "image1": [
          {
            "src": "/static/svg/Map.svg",
            "alt": "A map representing locations of The Meeting House churches."
          }
        ],
        "header1": "See you Sunday?",
        "text1": "Browse through all our locations or find the one that's closest to you.",
        "text2": "If you've got any more questions or would like to connect with someone, just scroll down to the footer and click on connect.",
        "link1Text": "Show Map",
        "link1Action": "/find-sunday-morning",
        "class": "locations",
        "showLocationSearch": true
      }
    ]
  }
}
