{
    "page": {
        "name": "sunday-morning",
        "title": "Sunday Morning",
        "keywords": "",
        "description":"",

        "pageConfig": {
            "movingMenu": false,
            "showLogoText": true,
            "logoColor":"black",
            "showSearch":true,
            "showFooter":true,
            "showMenu":true
        },
        "content": [
           
            {
                "type": "hero",
                "style": "full",
                "image1": [
                    {
                        "src": "/static/images/sunday-morning-1.jpg",
                        "alt": "Woman holding her infant and smiling at the camera."
                    }
                ],
                "header1": "We Can't Wait for Sunday Morning",
                "header2": "",
                "text1": "We gather on Sundays across multiple locations for teaching, music, prayer, and volunteering. We make space for spiritual seekers to come and ask questions, connect community, and explore faith."
              
            },
            {
                "type": "list",
                "style": "imageList",
                "header1": "What To Expect",
                "text1": "We keep it pretty simple.",
                "list": [
                    {
                        "title": "Before",
                        "text": "Want to join us this Sunday but aren't sure what to expect? We gather to hang out and learn how we can grow as followers of Jesus through music, teaching, and volunteering. This is what we call church: the gathering of people with a purpose.",
                        "imageSrc": "/static/images/sunday-morning-2-1.jpg",
                        "imageAlt": "Three people standing by the doors of the Oakville site"
                    },
                    {
                        "title": "Music and Teaching",
                        "text": "During the week, we meet in homes to further study and apply Sunday's teaching, build relationships in smaller groups, and care for our local neighbourhoods. We call this Home Church—and it's kind of the best thing we've got going.",
                        "imageSrc": "/static/images/sunday-morning-2-2.jpg",
                        "imageAlt": "Three people sitting around a dining room table eating snacks"
                    },
                    {
                        "title": "After",
                        "text": "We work together to create a safe community where our kids and youth can learn to love and follow Jesus. We do this through building relationships, equipping parents, and developing our own curriculum. Learn more about our programs.",
                        "imageSrc": "/static/images/sunday-morning-2-3.jpg",
                        "imageAlt": "Two kids smiling"
                    }
                ]
            },
            {
                "type": "instagram"
            },

            {
                "type": "hero",
                "style": "partialNoFooter",
                "image1": [
                    {
                        "src": "/static/svg/Map.svg",
                        "alt": "A map representing locations of The Meeting House churches."
                    }
                ],
                "header1": "Locations",
                "text1": "It's pretty simple: we get together each week to hang out, build relationships, and find ways to love and serve our local communities as we learn to follow Jesus.",
                "text2": "What are you doing this Sunday?",
                "link1Text": "Show Map",
                "link1Action": "find-sunday-morning",
                "class":"locations",
                "showLocationSearch": true
            }
        ]
    }
}