{
  "page": {
    "name": "Sexual Misconduct and Harassment",
    "title": "Sexual Misconduct and Harassment",
    "keywords": "",
    "description": "",
    "pageConfig": {
      "showLive": true,
      "movingMenu": false,
      "showLogoText": true,
      "logoColor": "black",
      "showSearch": true,
      "showFooter": true,
      "showMenu": true
    },
    "content": [
      {
        "type": "og-tags",
        "image": "/static/images/og-images/TMH-House-Logo.jpg",
        "url": "https://www.themeetinghouse.com/victimadvocacy",
        "title": "Victim Advocacy",
        "description": "This page is for those who think they may have experienced sexual misconduct or abuse by a pastor, staff member, or lay leader within The Meeting House. Check it out to see ways to contact a victim advocacy, access counselling, or connect with a pastor."
      },
      {
        "type": "hero",
        "style": "full",
        "image1": [
          {
            "src": "/static/images/anton-darius-IuQKQxZs-TA-unsplash.jpg",
            "alt": "View of a blue sky through yellow leaves."
          }
        ],
        "header1": "Submit a Complaint",
        "header2": "",
        "text1": "The Meeting House is committed to ensuring that our congregations are safe and healthy communities for all to become disciples of Jesus. We desire an environment that is free from harassment and abuse of any kind, including sexual misconduct. To submit a sexual misconduct complaint, click below to contact our independent complaint intake partner, Linda Lambert.",
        "button1": {
          "text": "Contact Linda",
          "action": "https://meeting.formstack.com/forms/sexual_misconduct_complainant_form",
          "description": "Button to sexual misconduct reporting form."
        }
      },
      {
        "type": "content",
        "style": "greyTwoText",
        "header1": "Sexual Misconduct and Harassment",
        "header2": "",
        "text1": "All sexual misconduct is unacceptable and will not be tolerated in any context. We are committed to the prevention of sexual misconduct through regular training and appropriate measures of accountability for all staff, leaders, and volunteers. Complaints of sexual misconduct will be treated with integrity, fairness, and concern for the well-being of the complainants and those accused. Our Sexual Misconduct and Harassment Policy provides an overall prevention and response framework for all forms of sexual misconduct and abuse. If you have questions about this policy, you can contact us.",
        "text2": "",
        "list": [
          {
            "type": "link",
            "title": "Email us",
            "navigateTo": "mailto:hello@themeetinghouse.com",
            "openNewBrowser": true
          }
        ]
      },
      {
        "type": "content",
        "style": "oneImage",
        "header1": "Who's Linda Lambert?",
        "header2": "",
        "text1": "Dr. Linda Lambert is a therapist practicing in the Niagara area. She is a Registered Nurse, has a BA in Psychology degree, post-graduate education in Pastoral Counselling, a Master of Divinity degree, and a Doctor of Ministry degree in Marriage and Family Counselling. Linda’s varied career experience includes work as a Psychiatric Nurse and Psychiatric Research Nurse, as an Ordained Pastor, as a Pastoral Counsellor, and Marriage and Family Therapist.",
        "image1": [
          {
            "src": "/static/images/TMH_House_Symbol_1280x1280.jpg",
            "alt": "Graphic of The Meeting House logo."
          }
        ],
        "list": [
          {
            "type": "link",
            "title": "Email Linda",
            "navigateTo": "mailto:drlindalambert92@gmail.com"
          }
        ]
      }
    ]
  }
}
